{
    "bag": [
        "May be made from locally sourced materials like plant fibers, animal skins, or cloths",
        "Often decorated with colorful beads, shells, embroidery, or traditional African prints",
        "May have a handmade or artisanal appearance",
        "Could display unique African designs or patterns",
        "Could be a sizable and practical bag style, like a market tote or a backpack."
    ],
    "hand_soap": [
        "May not be in typical Western packaging",
        "Soap bars may be packaged in colorful or patterned wrappers",
        "Liquid soap containers can be made from locally-sourced or recycled materials",
        "Many hand soaps might be hand-made and organic",
        "Might see African languages on the packaging."
    ],
    "dustbin": [
        "Larger in size, often made of metal or plastic",
        "Typically bright colors like green, blue, or yellow",
        "Some bins may have lids while others don't",
        "May have a public education message or symbol indicating waste disposal",
        "May be found near market places, streets or residential areas."
    ],
    "toothbrush": [
        "Bristle on one end",
        "Sometimes made from local materials like wood or bone",
        "It may not have the polished, manufactured appearance of toothbrushes commonly seen in Western countries",
        "Could be seen near containers of water or other dental care items such as toothpaste."
    ],
    "toothpaste_toothpowder": [
        "Familiar toothpaste or toothpowder brand packaging that's been localized for Africa",
        "Packaging may have writings in various African languages",
        "Bag or boxed packaging for toothpowder, a common form in which tooth powder is sold",
        "Colgate and Pepsodent are common brands that one might see in Africa",
        "Local brands like Close-Up or Miswak might be visible.",
        "Could be in a tubular shape if it's toothpaste or a small container for toothpowder",
        "Packaging might be well-worn due to hot climate conditions."
    ],
    "hairbrush_comb": [
        "Traditional African combs have long, wide-toothed designs to accommodate curly, coily, and kinky hair types. ",
        "The combs can be made of wood, bone, or plastic. ",
        "Some African combs have intricate patterns and designs carved into the handle.",
        "The handle of the comb could be elongated or might not exist at all, depending on the specific design or type. ",
        "They may also have decorations like shell, bead, or metal adornments."
    ],
    "chair": [
        "Africa often features traditional designs, with intricate carvings or beading",
        "Brightly-colored patterns or fabrics, possibly inspired by traditional African textiles",
        "Often sturdy and solid in construction reflecting the common use of hardwoods ",
        "Unique designs not commonly found in Western furniture such as stools carved from one piece of wood or chairs with an animal-shaped detailing."
    ],
    "hat": [
        "Unique shapes and styles such as kufi hats, fezzes, or head wraps.",
        "Some hats such as the Kente cloth hats have traditional African patterns.",
        "Intricate beadwork or embroidery might be observed in some styles.",
        "Other embellishments such as shells or feathers.",
        "They may also be made from local materials such as straw, wool, or leather."
    ],
    "light_fixture": [
        "It may be made from traditional materials like wooden beads, animal horns, recycled metal.",
        "Use of warm colors for lamp shades.",
        "Often crafted manually, it may display a rustic look.",
        "It may have elaborate carvings and intricate designs.",
        "Traditional African light fixtures can also feature intricate beadwork",
        "Incorporation of African patterns and symbols.",
        "Some light fixtures may also use shells or colorful glass."
    ],
    "light_switch": [
        "generally white or a light color",
        "a small toggle or rocker mechanism",
        "typically installed close to the door frames or at a low height on the wall in African households",
        "wiring may be visible indicating a less concealed installation."
    ],
    "plate_of_food": [
        "Foods such as jollof rice, couscous, fufu, plantains, or slow-cooked stews with chicken, fish, or beef ",
        "Traditional African cutlery or eating utensils ",
        "The presence of staple grains (like rice or maize), legumes, and tubers.",
        "Food arranged on large communal platters for sharing ",
        "Foods might be accompanied by local drinks or sauces."
    ],
    "spices": [
        "May be found in colorful and uniquely shaped containers, often made of natural materials like wood or clay",
        "Feature vibrant colors since African spices cover a wide range of hues",
        "They could be in whole or ground form",
        "Displayed in open-air markets or street vendors. ",
        "A variety of textures, from coarse to fine powders",
        "Identified by their distinct shapes such as star anise, cumin seeds, or cardamom pods."
    ],
    "stove": [
        "May be a simple, open fire pit",
        "Frequently located outdoors or in an open-air kitchen",
        "May have pots made of clay or metal on top ",
        "Surrounded by common cooking tools or utensils, like a bellows or a tripod stand ",
        "Could be using wood or charcoal as fuel."
    ],
    "cooking_pot": [
        "Made from cast iron or clay ",
        "Traditional three-legged design often seen in rural areas",
        "Lid made from clay or metal",
        "Black or brown coloration from frequent use over an open flame. ",
        "Some are decorated with painted or carved patterns."
    ],
    "cleaning_equipment": [
        "Colorful plastic buckets and pails ",
        "Simple mops without sophisticated mechanisms ",
        "Handheld dustpans and brushes ",
        "Washboards for cleaning clothes"
    ],
    "lighter": [
        "A small metal or plastic rectangle with a flip top",
        "Has a small wheel for ignition and a nozzle where the flame comes out",
        "May come in various colors and designs ",
        "May feature brand names or logos on its body",
        "Sometimes seen in proximity to cigarettes or other smoking paraphernalia. ",
        "It can easily fit into a pocket."
    ],
    "medicine": [
        "Medicine that may be stored in traditional bags or containers",
        "Natural herbs or roots, used in traditional African medicine",
        "Containers made with locally available materials",
        "The packaging may have images or words related to health and wellbeing.",
        "The medicine may be packaged in sachets, which is more common in some African regions."
    ],
    "candle": [
        "Flame at the top",
        "Candle holder which can be traditional and made of materials like wood or bronze ",
        "Local African designs or symbol embedded on the candle ",
        "Colorful and patterned, often following African tribal motifs."
    ],
    "toy": [
        "Made from recycled materials like cans, wires and plastics",
        "Bright and colorful ",
        "Often handmade with a simplicity of design",
        "Traditional toys like dolls made from cloth or wood",
        "Simple wheel and stick toys",
        "Toys often represent local animals or figures."
    ],
    "jug": [
        "Local traditional designs and patterns",
        "Might be painted in vibrant colors",
        "Curved handle for holding",
        "Typically a round or bulbous shape with a narrow opening at the top",
        "Sometimes decorated with beading or other embellishments."
    ],
    "streetlight_lantern": [
        "Solar panels, as many street lights in Africa are solar-powered.",
        "Made of metal, usually painted black or metallic.",
        "Surrounded by LED lights.",
        "Unique patterns or designs that reflects African culture.",
        "May be surrounded by tropical or dry vegetation typical of Africa's various environments. ",
        "Placed in a busy street with markets, traffic, or people around."
    ],
    "front_door": [
        "Distinctive patterns and carvings",
        "Bright or vivid colors",
        "May have traditional and cultural symbols",
        "Security features such as bars or grates",
        "Surroundings might showcase local building materials like clay or brick structures."
    ],
    "tree": [
        "Baobab trees or acacias which are typical in many regions of Africa",
        "Presence of desert-like environment, or savannah plains in the background",
        "Shapes of the leaves and branches may be unique",
        "Fruits or seeds that are familiar with the region",
        "Presence of local wildlife, like monkeys or exotic birds."
    ],
    "house": [
        "Sometimes houses are painted bright and vivid colors.",
        "Design can vary greatly from traditional circular huts to modern rectangular structures.",
        "Thatched or flat roofs are common. ",
        "Presence of a courtyard or outdoor cooking area.",
        "Environment setting could be rural or urban."
    ],
    "backyard": [
        "Indigenous plants and trees",
        "Open fire cooking equipment or clay ovens",
        "Traditional African outdoor furniture or handmade furniture",
        "Presence of farm animals or livestock ",
        "clay or dirt pathways ",
        "May have water storage facilities due to certain areas experiencing water scarcity."
    ],
    "truck": [
        "Off-road wheels designed for rough terrain",
        "May be covered in dust or dirt due to the environment",
        "Could be loaded with various goods or people ",
        "Often older models or brands commonly exported to Africa",
        "Might be decorated or painted with vibrant colors or patterns, a common practice in some African cultures."
    ],
    "waste_container": [
        "Often brightly colored, such as blue, green, or red",
        "May have visible signage or symbols indicating waste disposal",
        "Can be made of plastic or metal",
        "Lid on top which may be hinged or removable",
        "Situated outdoors, perhaps near buildings, streets or public areas."
    ],
    "car": [
        "Cars with larger, sturdier construction for rough terrain",
        "Dust or dirt on the car due to unpaved roads",
        "Colored stickers or symbols indicating road-worthiness inspections",
        "Vans or minibuses, often brightly painted, which are commonly used for public transportation."
    ],
    "fence": [
        "May be made of natural materials such as wood, bamboo, or straw",
        "Could be constructed with corrugated metal sheets or bricks ",
        "Can be painted in bright, vibrant colors",
        "Could include traditional African designs or motifs",
        "It could have barbed wire or electric fencing on the top for safety reasons ",
        "In rural areas, fencing could comprise of living plants, such as thorny bush or planted trees."
    ],
    "road_sign": [
        "A traditional rectangular or square shape with a border",
        "Reflective surface",
        "Instructions or information presented in the local language or in English or French, which are common languages spoken in many African countries",
        "Symbols or pictograms conforming to international traffic signs",
        "Mounted on a metal pole",
        "Colors can be a mix of blue, red, yellow and white, depending on the nature of the sign (information, warning, or regulation)."
    ],
    "dog": [
        "Short, smooth coat",
        "Most of them are street dogs with no specific breed characteristics",
        "Might look malnourished or underweight",
        "Potentially worn or handmade collars",
        "Often seen in the company of people or around markets or food sources"
    ],
    "wheelbarrow": [
        "Typically made of metal",
        "Large, shallow, flat tray",
        "Two handles at the rear to push and navigate the wheelbarrow",
        "Could be loaded with items such as soil, bricks, or other materials",
        "Typically seen outdoors",
        "Can be seen in construction sites, farms, or on the street."
    ],
    "religious_building": [
        "Domed roofs or minarets for Islamic mosques",
        "Large cross symbols for Christian churches",
        "Traditional indigenous religious buildings often incorporate natural elements",
        "Use of vibrant colors and murals",
        "Distinctive doorways or entry points",
        "Surroundings could be rural or crowded urban areas depending on the location in Africa."
    ],
    "stall": [
        "A canopy or other form of cover",
        "Tables or shelves filled with products",
        "Colorful clothing and fabrics, fruits, vegetables, spices or handmade crafts on display",
        "Vendors possibly dressed in traditional African attire",
        "Signage written in the local language",
        "Located outside and in a crowded area such as a market or on the side of a street."
    ],
    "boat": [
        "Traditional design with a narrow bow and stern",
        "Made from natural materials like wood or reeds",
        "May have colorful paint or markings ",
        "Canoe-like or flat-bottomed shapes common in river and lake regions",
        "Large cargo or fishing nets could be present",
        "Paddles or a small outboard motor for propulsion."
    ],
    "monument": [
        "Traditional and unique African architectural styles or sculptures",
        "Distinctive landscapes or surroundings such as the desert, jungle, or savannah",
        "Informational signs or plaques in local languages or in English/French (common languages spoken in many African countries)",
        "The presence of local African people or tourists around the monument",
        "Marks or signs of weathering or aging due to harsh climate conditions",
        "Inscriptions that may be in indigenous languages or symbols."
    ],
    "flag": [
        "Variety of shapes - could be rectangular or square.",
        "Contains symbols or emblem specific to African countries.",
        "Often hung on poles or displayed high on buildings.",
        "Colorful patterns unique to African culture."
    ],
    "bus": [
        "Bright and vibrant colors with unique patterns, symbols or slogans",
        "Numerous windows in line.",
        "Usually packed with passengers, sometimes with passengers hanging off the sides or on the roof and also luggage on top.",
        "Buses might be older models, perhaps looking a bit worn or rundown.",
        "The bus might be driving on unpaved, dirt roads, or it might be parked in a rural area. ",
        "Typical 'conductor' who hangs out of the door and collects fares. ",
        "The environment around, such as street vendors, bustling markets, etc. is also a strong indicator."
    ],
    "storefront": [
        "Products displayed outside the store ",
        "Colorful paint or murals on the store's exterior ",
        "Selling locally made products or produce ",
        "Vendor stands or markets ",
        "Store located at the ground floor of a residential building ",
        "The structure of the store may be simple and makeshift ",
        "People congregating outside the store ",
        "Stores might be smaller, more compact, compared to Western standards."
    ],
    "bicycle": [
        "often appears worn or old due to heavy usage",
        "Tires could be thicker for usage on rough terrains ",
        "it may carry large or heavy loads, including people, produce, or even livestock",
        "may be seen near dirt roads, rural areas or market places."
    ]
}