{
    "bag": [
        "container",
        "made of various materials (leather, fabric, plastic, etc.)",
        "portable",
        "handles or straps",
        "used for carrying personal items or goods",
        "may feature colorful patterns, traditional African designs or symbols",
        "can vary in size from small pouches to large travel bags or backpacks",
        "Mainly made of leather, fabric or plastics",
        "Handles or straps for carrying",
        "Zippers, clasps, or buttons for closure",
        "Pockets or compartments",
        "Various sizes and colors",
        "Design patterns may vary, could be solid, striped, checkered, or featuring different prints",
        "It could either be hand-held, shoulder carried, backpack style or even wheeled in some cases.",
        "Typically, the designs may be influenced by East Asian culture.",
        "It can have various shapes and sizes, from small purses to large backpacks.",
        "The presence of straps or handles.",
        "Incorporation of local patterns, symbols or scripts.",
        "Could be carried by a person or placed on a surface.",
        "Zippers, buckles, or closures may be visible.",
        "Rectangular, square, or round shape",
        "Materials like leather, synthetic, cloth or canvas",
        "Typically have handles or straps",
        "Sometimes have logos or brand names",
        "Can be in various colors and sizes",
        "Pockets or zippers are commonly seen",
        "In Europe, high fashion brands such as Louis Vuitton, Gucci, Prada, Chanel are more common. ",
        "Some specific styles like backpack, tote bag, clutch, handbag, purse, duffel bag, suitcase.",
        "Handles or straps",
        "Made of materials such as cloth, leather, plastic, or straw",
        "Patterns or designs that might reflect Asian culture",
        "Often seen carried by people or stored in various settings like markets, streets, or homes. ",
        "Zippers, clasps, or buttons",
        "Varying sizes ",
        "May have brand logos or labels",
        "Straps or handles for carrying",
        "Materials like leather, cloth, or woven reeds",
        "Embellishments such as embroidery, beading, or metallic accents, these can sometimes be indicative of the region",
        "Traditional patterns or colors associated with West Asia",
        "Shapes - could be anything from backpacks, handbags to satchels or tote bags",
        "Buckles, zippers, or fastenings",
        "Might be seen carried by individuals or being sold in markets."
    ],
    "hand_soap": [
        "small, often rectangular or round shape ",
        "might be bar or liquid soap ",
        "packaging or case may have African languages or local brand logos ",
        "possibly displayed in a setting that looks like a bathroom or kitchen ",
        "possible soap dispenser if it is liquid soap ",
        "often found near a sink or a tap.",
        "Label/information (in English, Spanish, French or Portuguese - main languages in The Americas)",
        "Frequently has a pump dispenser",
        "Can be translucent or opaque",
        "Often colorful or white ",
        "Usually small enough to be easily held by one hand",
        "It can be liquid or solid (bar soap).",
        "Brand logos (like Dial, Dove, Softsoap) ",
        "Soap bubbles or foam.",
        "dispenser pump on top",
        "liquid or gel-like substance",
        "labels often containing characters from East Asian languages (such as Chinese, Korean, or Japanese)",
        "sometimes clear or semi-transparent container to show the soap inside",
        "available in various colors depending on the type of soap. ",
        "often seen in bathroom setting or near sinks.",
        "brand names or labels in European languages",
        "pump on top (for liquid soap)",
        "located near a sink or in a bathroom setting",
        "can be various colors ",
        "sometimes has a logo of eco-friendly or dermatologically tested",
        "might have Europe's recycling symbol on packaging.",
        "generally packaged in a plastic bottle",
        "pump dispenser or squeeze bottle",
        "identifiable brand logo and label in various languages including English, Vietnamese, Thai, Bahasa Indonesia, or others used in Southeast Asia",
        "often brightly colored or clear liquid visible inside the bottle",
        "images or illustrations of a hand, bubbles, or specific ingredients on the label",
        "liquid, bar, or foam form visible ",
        "usually seen in bathroom or kitchen setting",
        "usually small in size ",
        "the presence of pump if it's liquid soap",
        "words or labels indicating it's hand soap, often in Arabic or other West Asian languages",
        "soap bars may come in colors like white, yellow, pink, or purple",
        "usually found in bathrooms, kitchens, or sinks areas."
    ],
    "dustbin": [
        "Top either flat or domed, sometimes with a opening for waste disposal",
        "Usually made of plastic or metal ",
        "Comes in various colors, but green, blue and grey are quite common",
        "Might exhibit labels or signs related to waste disposal",
        "May have a lid on top to prevent littering",
        "Can be seen often near streets, parks, and other public places.",
        "Trash inside ",
        "Materials can be plastic or metal",
        "Usually black, green or blue in color",
        "Sometimes shows recycling symbol or waste symbol",
        "Can have lids or flaps at the top ",
        "Larger bins may have wheels",
        "Can be seen often in public places like streets, parks, or beside buildings.",
        "made of plastic, metal, or other materials",
        "can have lids",
        "commonly comes in colors such as green, blue, grey, brown, or black",
        "regularly labeled with recycling or garbage signage",
        "located at street corners, parks, and in front of buildings",
        "can have a pedal for hands-free opening",
        "unique designs or shapes depending on the country.",
        "often green, black or grey in color",
        "lid on top",
        "may have a foot pedal for hands-free opening",
        "usually made of hard plastic or metal",
        "often has a municipality logo or trash sorting instructions in various European languages",
        "commonly seen near streets, parks, or building corners.",
        "lid or open top",
        "generally made of plastic or metal",
        "may have a pedal for hands-free opening",
        "often bears signage indicating waste disposal",
        "commonly found near streets, parks, alleyways, or buildings",
        "available in various colors but predominantly green, blue, or grey in Southeast Asia",
        "sometimes has labels for specific types of waste (e.g., organic, recyclable, general waste)  ",
        "in public areas, it may be stationed next to a cleaning cart or maintenance area.",
        "usually made of plastic or metal",
        "typical colors are green, blue, grey or black",
        "a lid on top, often with a hinge for opening",
        "may have a foot pedal for hands-free opening",
        "may have wheels at the bottom for easy transportation",
        "may display symbols or words related to waste disposal",
        "located typically in streets, parks, or corners of a room or space."
    ],
    "toothbrush": [
        "Bristles on one end of the handle",
        "Sometimes has a grip area on the handle",
        "Variety of colors but often white or blue",
        "Tubular handle shape",
        "Sometimes seen near a sink, mirror, or tube of toothpaste",
        "thin, elongated handle",
        "brush head at one end of the handle",
        "bristles on the brush head",
        "made of plastic most of the time",
        "can come in multitude of colors",
        "sometimes electric with a charging stand ",
        "might have a toothpaste tube nearby",
        "bristles at one end",
        "can be various colors",
        "some models might have a tongue cleaner on the back of the head",
        "battery-operated versions might have a thicker handle",
        "specific brand features relating to East Asian brands.",
        "bristles on one end",
        "elongated handle",
        "can be various colors ",
        "may have electric components (if it's an electric toothbrush)",
        "often found near sinks or in bathrooms",
        "the design does not typically vary by continent, so a toothbrush in a photo taken in Europe would look similar to toothbrushes elsewhere.",
        "bristles at one end",
        "handle at the other end",
        "could come in various colors ",
        "may be seen near a tube of toothpaste, a sink, or a bathroom",
        "the bristle design might be unique to Southeast Asia's market.",
        "small size",
        "long handle with bristles on one end",
        "typically plastic, though can vary in material",
        "variety of colors",
        "often positioned near water sources (sinks, etc.)",
        "may be found in bathrooms or toiletry kits."
    ],
    "toothpaste_toothpowder": [
        "A cylindrical tube, often with a colorful design or branding",
        "White or colored paste or powder ",
        "Packaging with information written in local African languages or with images typical to Africa",
        "The paste or powder may be shown being squeezed out of the tube or onto a toothbrush",
        "It may also be found in local, distinctly African settings, like an African home or market.",
        "Brand names specific to The Americas such as Crest, Colgate, or Arm & Hammer",
        "Packaging often includes imagery related to cleanliness, such as sparkles or fresh mint leaves",
        "Containers often feature small, circular openings",
        "Often accompanied by a toothbrush",
        "Generally comes in tube format, either upright or designed to lay horizontally.",
        "Typically contained in a small bottle or jar",
        "Powdery texture",
        "Labels could be in East Asian languages such as Chinese, Japanese, or Korean",
        "Common brands may include Lion, Darlie or Yunnan Baiyao",
        "Usually comes with a small spoon or spatula for dispensing",
        "May display symbols of dental health or images of teeth on packaging ",
        "Packaging colors typically white, blue, green, or red.",
        "A tubular or a box-like container",
        "Labeling in European languages such as English, French, German, Spanish, etc.",
        "The brand logos of European toothpaste companies",
        "The product is often white or light-colored",
        "The text on the packaging indicating the type of product",
        "The presence of something for application such as a toothbrush.",
        "typically comes in a small box or tin",
        "has powdery consistency",
        "often has Southeast Asian languages and/or brands on the label",
        "usually has images or graphics indicating dental hygiene or fresh breath on the packaging.",
        "Usually has a cap or lid",
        "Often white or mint-colored substance",
        "Branding or labels might be in Arabic or other West Asian languages",
        "May show signs of use like creases in the tube or powder residue on the container.",
        "Could be seen in a bathroom setting or near tooth brushes."
    ],
    "hairbrush_comb": [
        "Multiple thin, even bristles or teeth",
        "Handle for holding the brush or comb",
        "Mostly made of plastic, wood, or metal",
        "Can be in a variety of colors, but often black, white, or brown.",
        "bristles or teeth for detangling hair",
        "handle for gripping",
        "made of materials such as plastic, metal, or wood",
        "come in various colors but often black, brown, or white. ",
        "Some may have a mirror on their backs. ",
        "If it's a foldable, it may have a hinge in the mid.",
        "handle for gripping",
        "row of teeth or bristles",
        "can be made from plastic, wood, or metal",
        "comes in various sizes and shapes ",
        "certain styles can reflect East Asian aesthetics, such as the intricate wooden combs seen in China",
        "Rectangular or oval shape",
        "Handle for gripping",
        "Bristles or teeth along one side",
        "Plastic or wooden material",
        "Compact and portable size",
        "Can come in variety of colors.",
        "Long, narrow with a handle ",
        "Rows of thin, evenly-spaced teeth ",
        "Typically made of plastic, metal, or wood",
        "Usually found in bathroom or bedroom settings ",
        "May be found near other grooming products like hair products, mirrors, or towels. ",
        "Variations in design and style, influenced by local culture or materials.",
        "Rows of rigid but small pins or bristles",
        "May be made of plastic, wood or metal",
        "Shapes can vary but often rectangular or oval ",
        "Could have a pointed end for sectioning hair",
        "Could be a variety of colors, but often black or brown",
        "May have decorative or cultural designs related to West Asia on the handle or back of the comb"
    ],
    "chair": [
        "backrest ",
        "seat ",
        "often made from wood, metal, or plastic ",
        "sometimes has cushioning on the seat/backrest",
        "could feature African design patterns or motifs if it is traditional African chair.",
        "most commonly made of wood, plastic, or metal",
        "a flat seat",
        "may have armrests and backrest",
        "sometimes may have cushioning on the seat and backrest",
        "can come in different colors and designs depending on the style",
        "might have decorative elements if it's an antique or specially designed chair.",
        "a seat",
        "a backrest",
        "made of materials such as wood, bamboo, or metal",
        "Asian-style design features like simple lines, minimalistic design, or lacquered finish",
        "could be low to the ground, in traditional styles",
        "circular seat in some traditional designs",
        "decorative elements reflecting East Asian culture.",
        "A seat",
        "Backrest",
        "Designs and styles can vary, but European styles often include detailed woodwork or ornate designs",
        "Could be made of wood, metal, plastic or upholstered with fabric",
        "Can be situated in various settings such as a dining room, living room, study, or outdoors.",
        "a seat and a backrest ",
        "possibly made of bamboo, teak or rattan, common materials in Southeast Asia ",
        "intricate carvings or designs, representative of Southeast Asian cultures ",
        "It may also be low sitting or a floor chair, common in some Southeast Asian cultures",
        "could be seen being used indoor or outdoor.",
        "generally a four-legged item",
        "straight or slightly curved backrest",
        "made from materials like wood, metal or plastic",
        "sometimes padded or covered in fabric",
        "might include intricate designs or carving specific to West Asian style",
        "might include ornate, jewel or metal embellishments indicating cultural influence",
        "could have rounded or geometrically patterned armrests",
        "might be placed on a woven carpet, a common feature in West Asian interiors."
    ],
    "hat": [
        "Brim around the edges",
        "Made of different materials like fabric, straw, leather, or fur",
        "May be colorful or adorned with African tribal patterns",
        "Sometimes traditional with unique shapes depending on the specific African culture or tribe ",
        "Often used for sun protection so could be under direct sunlight.",
        "Brim around the edge",
        "Dome-shaped crown",
        "Made of materials like straw, felt, or cotton",
        "Could have embellishments like a bow, band, or feathers",
        "May have a western cowboy style or baseball cap style depending on region in the Americas",
        "Various colors and patterns.",
        "made from bamboo, straw, or fabric",
        "could be in a conical shape or flat-topped ",
        "sometimes has chin straps",
        "Patterns may vary, including solid colors to intricate woven designs or embroidered patterns",
        "In some cases, it can have symbols that symbolize East Asian culture.",
        "Round or oval shaped",
        "Comes in various materials (felt, straw, wool, leather)",
        "Brim that goes all around the tent ",
        "Different styles like berets, flat caps, bonnets, trilbys, fedoras, etc. ",
        "European hats may have traditional or cultural styling depending on the country",
        "Decorative elements like ribbons, feathers, or badges",
        "Worn on the head.",
        "Made from lightweight materials such as straw or bamboo",
        "Often a chin strap to keep the hat in place",
        "Can include unique aspects of regional style or traditional designs",
        "Depending on the type, it may have a pointed or flat top",
        "Often worn outdoors, in farming or market scenes.",
        "might be made from wool or felt",
        "often features elaborate embroidery or embellishments",
        "varying colors, but often seen in darker shades like black, brown, or dark green",
        "may have tassels or fringes",
        "can be seen worn on the top of the head of a person",
        "might be large enough to cover the whole top of the head, or small and fit snugly."
    ],
    "light_fixture": [
        "Electrical wires connected to it",
        "Mounted on the wall or ceiling",
        "May have bulbs or tubes",
        "Made of materials like glass, plastic, metal",
        "May have switch or knob for operating",
        "Could have unique African artistic designs, patterns, or colours",
        "May have protective casing in outdoor settings",
        "Illumination in the nearby area.",
        "Connected to ceiling or wall",
        "May be made of metal, glass, or plastic",
        "May have lampshades to diffuse light",
        "Could be paired with a light bulb",
        "Can be designed with multiple light sockets ",
        "May have switches or pull chains for controlling light ",
        "May have decorative elements like ornamental patterns ",
        "Sconces, chandeliers, pendant lights, recessed lights, or track lights types could be specific to The Americas.",
        "Lantern-shaped designs are common",
        "Red, gold and black colors frequently used",
        "Traditional fixtures may have intricate patterns or artistic designs",
        "Modern fixtures may have sleek, streamlined shapes",
        "May have Chinese characters or symbols",
        "Paper, silk, and wood, as well as metal and glass, are common materials",
        "Electric bulb or candles can be seen for illumination.",
        "made from materials like metal, glass, or plastic",
        "may have multiple bulbs or light sources",
        "may attach to a wall or hang from a ceiling",
        "may have decorative elements common in European styles, like intricate metalwork or glass designs",
        "cords or wires that connect to a power source",
        "in some cases, a switch or other control mechanism to operate the light",
        "often positioned above eye level",
        "lighting source such as a bulb or LED",
        "can be hanging, wall-mounted, standing or recessed",
        "fixtures can be made of various materials like metal, wood, glass, or plastic",
        "some may have specific Southeast Asian design features, including lantern-like structures, local decorative arts and crafts ",
        "may have a switch or cord for turning on and off",
        "comes in various shapes and sizes",
        "colors can vary, and some may be painted or stained with designs.",
        "cylindrical or geometric shaped",
        "often made of metal, glass or ceramic",
        "intricate patterns or designs, often reflective of local culture",
        "can be hanging from the ceiling or mounted on walls",
        "uses bulbs or candles to produce light",
        "can have color tints like blue, green or yellow",
        "might have ornamental fringe or edge details",
        "ornate or elaborate designs, reflective of Middle Eastern influence."
    ],
    "light_switch": [
        "small, typically rectangular or square device",
        "mounted on a wall",
        "made of plastic or metal",
        "white, cream, or colored to match the wall",
        "one or more buttons or toggles",
        "may have text or symbols indicating on/off positions",
        "Usually installed on a wall at a height accessible to a standing human",
        "Small rectangular shape",
        "Color often white or beige, matching the color of the wall",
        "Can be a rocker, toggle or push-button style",
        "A screw visible on the top and bottom of the switch plate",
        "Often located near doorways ",
        "May have one or multiple switches on a single plate for controlling different lights.",
        "Often square or rectangular in shape",
        "Usually white or light colored",
        "Oftentimes located on the wall",
        "In some countries like Japan, they may be larger with multiple switches",
        "Some might have labels or icons showing the function",
        "Usually installed at a standard height on the wall, close to the door frame",
        "May have one or more buttons or switches",
        "The switch flips up and down or side-to-side to turn on/off the light.",
        "Usually white or light colored",
        "Flat or slightly protruding toggle or rocker switch",
        "Typically wall mounted",
        "May have a visible mounting plate around the switch",
        "May have markings or symbols to indicate on/off positions.",
        "often white or beige",
        "typically plastic",
        "located on walls",
        "switch lever to turn on and off",
        "may have one or two switch buttons",
        "standardized symbols for on-off ",
        "sometimes they have a red or green indicator light.",
        "Wall-mounted position",
        "Long and narrow rectangular shape",
        "Switch lever or push button for operation",
        "Usually found near the entrance of rooms or nearby doorframes",
        "Often white, cream or light in color",
        "May also feature labels for on/off function",
        "Some may have two switches to control different light sources."
    ],
    "plate_of_food": [
        "A plate or bowl, typically circular",
        "Food items common in African cuisine such as jollof rice, fufu, injera, couscous, or various types of stew",
        "Bright and diverse colors",
        "Use of vegetables, meats, and spices",
        "Eating utensils like forks, spoons, or sometimes hands",
        "Food served in a communal style, seen in many African cultures.",
        "Typical American dishes like burgers, hot dogs, steaks, fries, etc.",
        "Eating utensils like forks, knives, spoons, etc. ",
        "Beverages like soda, beer, milkshakes etc.",
        "Sides like salads, bread rolls, coleslaw, vegetables",
        "Condiments like ketchup, mustard, BBQ sauce, etc. ",
        "Desserts like apple pie, brownies, ice cream.",
        "Chopsticks or spoons as utensils",
        "Rice or noodles as a staple dish",
        "Wide variety of vegetables, meats, and seafood",
        "Soup often included as part of a meal",
        "Unique dishes like dumplings, sushi, kimchi, etc.",
        "Use of spices and sauces",
        "Steamed or stir-fried dishes",
        "Tea or other traditional drinks often accompanying the meal.",
        "Various foods including meat, vegetables, grains, or dairy products",
        "Cutlery such as fork, knife, or spoon",
        "Presentation style including garnishes or sauce",
        "European cuisine related items like pasta, cheeses, sausages, baguettes, etc. ",
        "Drinks like wine or beer ",
        "Continental dining setup including placemats or tablecloths",
        "Traditional or known dishes from specific countries in Europe.",
        "Presence of rice or noodles",
        "Exotic fruits and vegetables",
        "Spices and herbs",
        "Curries or soups",
        "Seafood or chicken",
        "Use of chopsticks or spoons for eating",
        "Plates or bowl made up of bamboo or ceramics",
        "Commonly served with a side of sauces or dips.",
        "Flatbreads or rice as staple food items",
        "Variety of grilled meats or kebabs",
        "Dishes like hummus, falafel, or tabbouleh",
        "Use of spices such as saffron, turmeric, cumin",
        "Presence of olives or olive oil ",
        "Lots of fresh vegetables and fruits",
        "Foods may be arranged in a communal eating style."
    ],
    "spices": [
        "Variety of colors from different spices (red, yellow, brown)",
        "Small bowls or bags filled with powder or whole spices",
        "Specific spices such as cumin, turmeric, coriander, pepper that are common in Africa",
        "The rustic grinding tools like a mortar and pestle",
        "Spice markets or stalls",
        "Spices may be on display in large, open containers or poured out onto a surface",
        "The turban-wearing vendors typical of the African culture",
        "jars or packages with labels",
        "powdery or granulated textures",
        "various colors, like red, yellow, brown",
        "different shapes and sizes of seeds, leaves, or bark",
        "mortar and pestle",
        "commonly used in The Americas: chili pepper, allspice, vanilla, cacao.",
        "vibrant colors ranging from yellow (turmeric) to red (chilli powder) to brown (cumin)",
        "seeds, roots, bark, fruits, etc, in either whole or ground form",
        "labels in East Asian languages",
        "traditional East Asian bowls, spoons and other utensils",
        "distinct shapes of specific spices, like star anise, clove, cardamom.",
        "Powdered or whole form",
        "Vibrant colors such as yellow (turmeric), red (paprika), green (dried herbs), etc.",
        "Labels or writings in European languages.",
        "Settings or background showing a European kitchen or market.",
        "Sometimes displayed with specific traditional European dishes.",
        "Seeds, roots, tree barks or small powdery substances ",
        "Different sizes and shapes of spice containers",
        "Cinnamon sticks, pepper corns, star anise, turmeric roots, coriander seeds or saffron strands",
        "Labeled jars or packaging materials of spices with Southeast Asian languages ",
        "Traditional grinding tools made of stone or metal",
        "Spices commonly seen in local market settings or traditional kitchens.",
        "Different color variations: red, yellow, brown, black, white",
        "Can be seen in clear glass jars or in bags",
        "Often in dried form",
        "Can be seen in a market setting or in a kitchen",
        "Some common ones include saffron, turmeric, cumin, and coriander."
    ],
    "stove": [
        "chimney or vents",
        "can be made of clay, bricks, or modern materials such as stainless steel",
        "areas for placing pots and pans",
        "maybe seen indoor or outdoor depending on the type",
        "fuel source like wood, charcoal, or gas cylinders",
        "fire or smoke ",
        "cooking utensils nearby",
        "traditional African designs or markings for traditional stoves.",
        "Knobs for temperature control",
        "Burners where pots or pans can be placed",
        "Some stoves have a range hood overhead",
        "Usually metallic colours like silver, black, or white",
        "Oven section below the burners",
        "May also have a digital display panel",
        "May be installed between countertops in a kitchen setup.",
        "Made of steel or ceramic material",
        "Usually white, silver, or black in color",
        "Controlled dials and buttons",
        "Burners or induction zones on top",
        "Sometimes have a range hood on top ",
        "Some may have an oven at the bottom",
        "Typically located in the kitchen.",
        "generally square or rectangular shape",
        "control knobs or dials",
        "metallic build ",
        "burners or cooktops",
        "an oven door",
        "possible exhaust fan or hood",
        "location, often in a kitchen setting",
        "electric or gas powered, depending on the region",
        "may have a digital display",
        "may be fueled by gas or electricity",
        "can be a portable or fixed structure",
        "generally equipped with a series of burners or hotplates ",
        "may include a built-in oven",
        "knobs or dials for adjusting heat",
        "a chimney, in the case of traditional wood or coal burning stoves",
        "woks or pans may be present",
        "rectangular or square in shape",
        "presence of burners or heating elements",
        "knobs or dials on one side",
        "often accompanied by an oven or a grill",
        "may have a chimney or an exhaust fan above it",
        "a gas line or electrical cord might be visible."
    ],
    "cooking_pot": [
        "Large, round shape",
        "Usually blackened due to soot from firewood",
        "A lid might be present",
        "Depending on the region, some pots may be decorated with intricate designs or patterns",
        "Handles for lifting or moving",
        "Often seen outdoors over a fire.",
        "metallic or ceramic material",
        "round or oval shape",
        "handle or handles on the sides",
        "a lid which may also have a handle",
        "relatively heavy and solid",
        "can be found over a stove or in a kitchen setting",
        "comes in different sizes but generally large enough to prepare food",
        "colors can vary, with a common one being stainless steel silver, black, or copper.",
        "Usually made of metal (stainless steel, cast iron, or aluminum) or ceramic",
        "Often has two small handles on the sides",
        "A lid that fits on top",
        "Sometimes with a spout for pouring",
        "May have a polished or matte finish",
        "Could be over a stove or a fire",
        "Might have food or liquid inside",
        "In the context of East Asia, might be a wok or a clay pot.",
        "Metallic or ceramic material",
        "It may have handles on the sides",
        "A lid on top",
        "It might be sitting on a stove or cooktop",
        "Various sizes, often quite large",
        "Could be filled with food or liquid.",
        "made of metal, such as aluminium, stainless steel, or cast iron",
        "usually have handles or ears on both sides",
        "some may have a lid",
        "could be on a heat source such as a stove or open flame",
        "often larger in size to accommodate communal cooking",
        "can be used with a variety of cooking utensils like ladles or spatulas.",
        "Made of materials such as metal, clay or ceramic",
        "May have a lid",
        "Handles on the sides",
        "Might include intricate designs",
        "Darker colors due to usage over a fire",
        "May have a thick, sturdy bottom for cooking on various heat sources."
    ],
    "cleaning_equipment": [
        "Cylindrical or flat shapes with long handles (for brooms and mops)",
        "Often bright colored fibres at the end (for brooms and mops)",
        "Involvement of buckets and cleaning detergents",
        "Electronic equipment associated with a power cord (for vacuum cleaners)",
        "Dust mask or gloves could also be an indicator of cleaning activity ",
        "African specific context clues like African people, language on product labels, specific brands known to be in Africa, or African environments (such as homes or buildings typical in Africa).",
        "Broom, mop, or vacuum cleaner",
        "Containers of cleaning solutions or detergents",
        "Buckets or basins",
        "Brushes and sponges",
        "Protective gloves",
        "Symbols or text in English, Spanish, Portuguese or other languages spoken in The Americas",
        "Use in familiar environment such as a home, office, or janitorial room.",
        "Natural bristle wisk broom",
        "Plastic bucket for water",
        "Square-shaped scoops or dustpans",
        "Cleaning slippers ",
        "Cleaning rag",
        "Squeegee for cleaning windows",
        "Mop with replaceable cloth pads ",
        "Dust masks for cleaning dusty areas.",
        "broom or mop heads",
        "buckets",
        "vacuum cleaner with cords and a dust bag",
        "electric cordless cleaning appliances",
        "containers labeled with cleaning products or brands common in Europe",
        "brushes and scrubbers",
        "wheeled cleaning carts",
        "safety signage such as \"wet floor\" signs",
        "cleaning gloves",
        "spray bottles for cleaning solutions.",
        "Plastic buckets and basins in various colors",
        "Hand-held scrub brushes",
        "Sponges and mops",
        "Extension poles for high reach cleaning",
        "Liquid soap and detergent containers",
        "Cleaning cloths and rubber gloves",
        "Compact vacuum cleaners.",
        "brushes, brooms, or mops with long handles",
        "dustbins and trash cans",
        "vacuum cleaners",
        "buckets with cleaning liquids",
        "cloth rags or sponges",
        "various shapes and sizes depending on the specific cleaning tool",
        "use within a residential or commercial setting"
    ],
    "lighter": [
        "flicker or flame if lit",
        "usually made from plastic or metal",
        "potential brands like BIC or Zippo",
        "button or wheel for ignition",
        "may have a protective cap.",
        "small and handheld",
        "rectangular shape with rounded corners",
        "metal top where the flame is lit",
        "button or wheel used to produce the flame",
        "lighter fluid port, often seen at the bottom",
        "often made from plastic or metal",
        "may have branding or design elements on the body.",
        "Metal or plastic body",
        "A wheel or button for ignition",
        "Flame when ignited",
        "Often carry imagery, logos, or text on the body",
        "Fuel refill point at the bottom",
        "Portability",
        "Could possibly see it in someone's hand",
        "Brand logos such as Zippo or BIC that are common in East Asia",
        "Flip top or push button ignition",
        "Material is typically metal or plastic",
        "Often rectangular or cylindrical shape",
        "Visible fuel chamber or fuel level window",
        "Brand logos such as Zippo, Bic, or Clipper",
        "May have decorative designs or unique colors.",
        "small size ",
        "usually rectangular with curved edges ",
        "often made of metal or plastic",
        "a button or wheel to ignite",
        "a flame or spark when lit",
        "may have local brand names or pictures familiar to the Southeast Asian market",
        "could be found in hands or around smoking-related scenes.",
        "Rectangular or oval shape",
        "Metallic or plastic material",
        "Flint or electric spark mechanism",
        "Button or switch for ignition",
        "Small hole on the top for flame",
        "May bear brand logos or designs",
        "Often handheld."
    ],
    "medicine": [
        "Medical equipment or supplies such as pill bottles, syringes, or medical boxes",
        "Text or symbols indicating pharmaceutical brands or medical instructions",
        "Medical personnel such as doctors or nurses",
        "Local African context such as traditional healing herbs/plants, traditional healers or African-themed clinics or hospitals",
        "Packaging featuring English/Spanish/Portuguese text",
        "Common brand logos (like Tylenol, Advil, or Tums)",
        "Bottle or box-shaped containers",
        "Safety caps on bottles",
        "Tablets, pills, or liquid formation",
        "Labels include dosing instructions",
        "FDA approval mark",
        "Prescription bottles with labels",
        "Communication of side effects or warnings on the packaging",
        "Typically packaged in small bottles, boxes or blister packs",
        "Labels may be written in Chinese, Japanese, or Korean characters ",
        "Symbols or logos specific to East Asian pharmaceutical companies",
        "Images or illustrations of herbs and plants, as traditional medicine is popular in East Asia",
        "May come in various forms like pills, tablets, capsules, liquids, powders, or even in raw form as herbs.",
        "Labels featuring a variety of European languages",
        "Health and pharmacy symbols, like a green cross",
        "Brand names typical in European countries",
        "EU safety symbols or logos",
        "Tablets, capsules, or liquid form",
        "Instructions or descriptions in milligrams (mg) or other metric measurements.",
        "Packaging styles unique to Southeast Asia",
        "Unique brand logos or symbols that are recognizable in Southeast Asia",
        "Pill shapes and colors that are common in Southeast Asian medicines",
        "Images of common Southeast Asian medicinal herbs or ingredients on the packaging",
        "Barcodes or QR codes for authenticating the medicine in Southeast Asia.",
        "pharmaceutical bottles or boxes",
        "labels in Arabic or other West Asian languages",
        "medical symbols or logos, such as the snake-entwined rod ",
        "tablets, capsules, or liquid form medicines",
        "typically sold in pharmacies or health stores",
        "may show forms of traditional medicine unique to West Asia like herbal remedies ",
        "may have names of West Asian pharmaceutical companies ",
        "doctor's prescriptions or health reports written in local languages."
    ],
    "candle": [
        "cylindrical or sometimes conical shape",
        "typically white, ivory, or beeswax color, but could be any color",
        "wick at the top",
        "sometimes enclosed in glass or a holder",
        "sometimes has melted wax around it",
        "if lit, there will be a flame at the top",
        "African context could be indicated by surrounding objects or environment, such as African decor, traditional African patterns, or African landscapes.",
        "Wax or soy-based shape (cylindrical or square)",
        "Wick in the center ",
        "May be lit or unlit",
        "Usually accompanied by a holder or candlestick",
        "Can come in a variety of colors",
        "May have a decorative design or pattern",
        "Often used for lighting, ambiance, or aromatherapy.",
        "Wax or gel cylinder or block shape ",
        "Wick in the center of the candle",
        "Warm, soft glowing light when lit",
        "May be placed in a glass or metal holder",
        "Sometimes decorated with symbols or scripts ",
        "Often associated with spiritual or religious practices and ceremonies such as Buddha's Birthday",
        "May come in a variety of sizes and colors.",
        "Flame at one end",
        "Made of wax",
        "May be held in a candle holder",
        "In terms of being specifically in Europe, the candle could be shown in a European setting, like a traditional European home or church.",
        "typically cylindrical or taper-shaped",
        "made of wax",
        "has a wick in the middle",
        "may be lit with a visible flame",
        "can come in a variety of colors",
        "may be situated in a candle holder ",
        "often used in temples or ceremonies",
        "can have intricate designs and patterns common to Southeast Asia.",
        "Flame at the top",
        "Often in a holder or a stand",
        "Can be of any color",
        "Can be simple or decorative with intricate designs",
        "Possibly embellished with images, symbols, or writing particular to West Asian culture",
        "May be surrounded by traditional West Asian decor or architecture."
    ],
    "toy": [
        "Can be of various shapes and sizes",
        "May depict a popular character or animal",
        "Common types might include dolls, cars, balls, etc.",
        "Might be seen in the hands of a child or on a playground",
        "If the photo captures the surroundings, African scenery or landmarks could be visible.",
        "Recognizable shapes (like action figures, baseballs, teddy bears, etc.)",
        "Smaller in size compared to other objects",
        "Often found in child-friendly environments (like a playroom, park, etc.)",
        "May label or branding related to popular American cartoons or movies",
        "Packaging specific to North or South American markets if unboxed",
        "Often brightly colored or patterned",
        "May have Asian characters or symbols",
        "Often depict characters from popular Asian animations or comics",
        "May be made from materials such as plastic, cloth, or wood",
        "Could be traditional toys like dolls, paper toys, wooden toys",
        "Alternatively, could be modern toys like electronic games, building sets",
        "Size can vary but typically small enough for a child to play with.",
        "vibrant colors",
        "commonly made from plastic or fabric",
        "can be designed based on popular European cartoon characters",
        "typically found in children's rooms or toy stores",
        "often has safety markings following European safety standards",
        "commonly seen brands may include LEGO, Playmobil, or Corgi.",
        "Often based on traditional characters or animals",
        "Made of different materials including plastic, wood, fabric, and metal",
        "Can come in a range of sizes, from small handheld toys to larger play sets",
        "Might show cultural influences, such as Thai puppet dolls, Malaysian spinning tops, or Vietnamese water puppets. ",
        "Packaging may have Asian languages or symbols on it.",
        "Small in size",
        "Bright, multiple colors",
        "Made of plastic, wood, or fabric",
        "Could be shaped like animals, vehicles, or dolls",
        "Might have movable parts",
        "Might be modeled after popular characters or traditional West Asian figures or symbols",
        "Would appear not to serve a practical function",
        "May be held or surrounded by children."
    ],
    "jug": [
        "Usually large and cylindrical",
        "Made from materials like clay, ceramic, or metal",
        "Can have an round opening on the top",
        "Often has a handle on the side",
        "May have a spout for pouring liquids",
        "May feature African designs or patterns.",
        "It often has a handle",
        "It usually has a spout for pouring",
        "It could be round or oval in shape",
        "Can be small or large in size",
        "May have a lid or cork on top",
        "Could have various colors and designs depending on the specific culture in The Americas",
        "Commonly white or light-colored with painted designs",
        "May have a spout ",
        "An attached handle for holding",
        "Can be round or more cylindrical in shape ",
        "Often has a lid",
        "May contain traditional Asian motifs and patterns.",
        "handle on one side",
        "spout for pouring",
        "occasionally decorated with patterns or images",
        "can be varying sizes, but typically larger than a cup or mug",
        "large, bulbous body with a narrow opening at the top.",
        "typically made of clay, ceramic, metal or glass",
        "cylindrical or round in shape",
        "has a handle ",
        "often has a narrow neck and a spout for pouring ",
        "may be decorated with local designs or colors ",
        "may be seen in contexts such as kitchens, dining areas, or outdoor markets.",
        "often decorated with intricate patterns or designs",
        "may have a round body ",
        "a spout for pouring ",
        "a handle on one side",
        "often lidless",
        "traditional or antique look",
        "style and ornamentation reflect West Asian culture or tradition."
    ],
    "streetlight_lantern": [
        "mounted on a pole or attached to a building",
        "typically made of metal or hard plastic",
        "traditional or modern designs, with variations across different regions in Africa",
        "may have solar panels attached, especially in rural or off-grid areas",
        "emits light, so look for a glowing element in low-light conditions",
        "often designed to be weather-resistant, with features like waterproof casings",
        "might have distinctive shapes or colors that reflect local cultures or heritage",
        "tall vertical post",
        "mounted light fixture at the top",
        "predominantly metal or steel construction",
        "color is usually green, black, silver or bronze",
        "a distinct cover or shade over the bulb",
        "may be located near roadways or sidewalks",
        "style may vary, with some cylindrical or squarish",
        "may vary between single or double lamp designs",
        "some models may contain components for automated light control.",
        "lantern-style light fixtures on top, typically with a round or cylindrical shape",
        "the lights can be of various colors but usually white, yellow, or orange tones",
        "ornate designs, often alloy or metal, reflecting cultural aesthetics ",
        "sometimes embellished with traditional symbols or patterns",
        "usually found beside the roads or in a public area",
        "may have grills or patterned cut-outs to cover the light bulb.",
        "lantern-shaped light at the top",
        "often ornate, with intricate metal work",
        "commonly black or dark in color",
        "might include multiple lanterns on one pole",
        "typically located alongside roads or paths",
        "illuminated during nighttime or in dark conditions",
        "resemblance to historical or traditional European designs",
        "cylindrical or sometimes lantern-like shape",
        "supported on a tall pole",
        "often metal construction",
        "emits a bright light (especially noticeable in dusk or night photos)",
        "usually located along the roadside or pathway",
        "sometimes may have Asian-inspired decorative elements",
        "can range in size from small and subtle to large and impactful.",
        "Mounted light fixture",
        "Globe, rectangular, or hexagonal-shaped covers",
        "Metal framework",
        "Positioned on sidewalks or road sides",
        "Can be found in an urban environment or alongside a roadways",
        "Often associated with evening or nighttime scenes",
        "In West Asia, they might have more ornate, intricate designs or patterns."
    ],
    "front_door": [
        "typically wooden or metal construction",
        "presence of one or more locks or latches",
        "colors can vary, but often brightly painted in various patterns or plain colors",
        "may have window panes or decorative elements",
        "presence of a door handle or knob",
        "surrounded by a door frame",
        "might be flanked by windows or other architectural features typical to African houses",
        "could possibly have security features like bars or a metal gate.",
        "Panel or solid design, with or without windows",
        "Doorknob or handle, often on the right hand side",
        "A mailbox or mail slot",
        "Doorbell or knocker",
        "Deadbolt or keyhole",
        "Address number",
        "Steps leading up to the door",
        "In the U.S., typically outward opening",
        "A threshold or a stoop.",
        "rectangular shape",
        "a centrally positioned door knob or handle",
        "often decorated or painted with bright colors",
        "can feature Asian architecture styles like scrollwork, lattice patterns, or circular \"moon gates\"",
        "could have traditional Asian symbols or characters on it",
        "equipped with a door step, according to the traditional Chinese culture. ",
        "may include a unique combination of wood and metalwork. ",
        "can sometimes feature intricate carvings.",
        "rectangular or arched shape",
        "possible materials including wood, glass, or iron",
        "door handle, often in the middle in some European styles ",
        "letter slot",
        "a house number",
        "may have windows or panels",
        "doorstep or stair leading up to the door",
        "maybe flanked by sidelights or a transom window above",
        "a doorbell or knocker ",
        "unique European style ornaments or designs.",
        "Made of wood, metal, or glass",
        "May have intricate designs or carvings, especially in wood ",
        "Can be brightly colored in some regions ",
        "Handles or knobs for opening",
        "May have decorations or symbols related to local culture or religion",
        "Often surrounded by a frame or archway ",
        "Presence of a step or threshold at the bottom",
        "May have a distinctive letterbox or house number plate.",
        "hinges on one side",
        "some kind of handle or knob",
        "may contain decorative elements reflecting West Asian styles, such as intricate designs or mosaics",
        "may incorporate materials commonly used in West Asia, such as wood or metal",
        "probable presence of a doorway or archway",
        "could have features common in the region like a door knocker or unique lock system",
        "may include additional elements like a small entrance rug or a welcome sign."
    ],
    "tree": [
        "Different shades of green in large, leafy areas",
        "Bark textures that could be smooth, rough or flaky ",
        "Tall, straight trunk",
        "Unique shapes, such as umbrella or bottle shapes for baobab trees",
        "May have very wide, thick trunks with smaller branches on top",
        "Thorny branches or trunk for acacia trees",
        "Presence of local wild animals or birds",
        "The surrounding environment: savannah landscapes, desert, or tropical forest.",
        "shape and size of the tree",
        "type of leaves (deciduous or evergreen)",
        "shape, color and size of the leaves or needles",
        "presence of fruits or flowers",
        "branching pattern",
        "the tree's overall shape or silhouette.",
        "Broad leaves or needle-like leaves",
        "Specific characteristics of common East Asian trees (such as cherry blossoms, bamboo stalks, or gingko leaves)",
        "Presence of fruits or nuts",
        "Shape and size of the tree",
        "Root structure",
        "Location, such as within a forest or in a cityscape.",
        "Tall and erect structure",
        "Trunk, generally brown and covered in bark",
        "Branches spreading out from the trunk",
        "Green foliage, unless it's autumn or winter",
        "Could be deciduous (shed leaves annually) or evergreen (retain leaves year-round)",
        "Different shapes and sizes depending on type. For instance, an oak tree would be large and wide-spreading, while a pine tree would be tall and triangular.",
        "Broad, lush green leaves or needle-like leaves",
        "Tropical foliage",
        "Thicker, sometimes visible root structures due to rainforest humidity",
        "Barks may vary from smooth to very rough, depending on the species",
        "Species like palm trees, banyan trees, or bamboo are common",
        "Some trees may have fruits, like banana trees, durian trees, and coconut palms",
        "Some may have vines hanging down or growing up the tree.",
        "Dense or sparse foliage based on type",
        "Colors ranging from various shades of green to brown, depending on the season",
        "Local species like date palms or olive trees",
        "Roots that can be both below and above ground",
        "Leaves that can vary in size and shape based on species",
        "Fruits or flowers that are season-dependent and species-specific."
    ],
    "house": [
        "Buff, brown or red colors denoting earth/dirt/clay construction material",
        "Thatched or corrugated iron roofs ",
        "One or two-story structures ",
        "Simple, geometric structure with minimal adornment",
        "Surrounded by vegetation or arid landscape, depending on geographical region",
        "Overhanging eaves for shade and weather protection ",
        "Outdoor cooking spaces or communal areas ",
        "Absence of glass windows, replaced by wooden or metal shutters.",
        "varies in architectural style, can be ranch, colonial, victorian, modern, etc.",
        "mostly made of wood, bricks, or concrete",
        "typically two or more stories",
        "rectangular or square shape",
        "windows and doors",
        "roof, can be flat or pitched, often with shingles",
        "a front and/or backyard",
        "a driveway or garage ",
        "may have a porch or deck ",
        "chimney.",
        "Tiled roofs, often curved at the edges",
        "Use of natural materials like wood and stone",
        "Tranquil gardens featuring ponds and bridges",
        "Multilayered roofs in traditional houses",
        "Sliding doors or screens",
        "Courtyards in Chinese houses",
        "Korean Hanoks made up of small, square rooms",
        "Japanese houses often have Tatami floors",
        "Decorative carvings or bright colors in some regions.",
        "steeply pitched roofs in northern Europe",
        "bright and colorful facades in countries like Norway and Iceland",
        "stone or brick exterior walls",
        "chimneys",
        "often have small windows due to older construction",
        "terraced houses are common in cities",
        "shutters on windows in southern Europe",
        "balconies in Mediterranean regions",
        "gardens or small yards in front.",
        "stilt houses in rural areas ",
        "geometric patterned tiles",
        "brightly colored exterior ",
        "slanted, tiled or thatched roofs",
        "lush, tropical vegetation around ",
        "use of natural, local materials like bamboo, rattan, and timber.",
        "Light-colored exterior, often in white or beige",
        "Built using materials like mud, brick or stone",
        "Architectural design influenced by Islamic culture",
        "The use of arches and columns",
        "Can feature a courtyard",
        "Decorative tiles or mosaics",
        "Often surrounded by high walls for privacy",
        "Sometimes with balconies or terraces",
        "May feature large, ornate doors and windows with shutters."
    ],
    "backyard": [
        "Plants like Acacia, Baobab, or Elephant Grass",
        "Distinctive African wildlife (if present) such as monkeys, birds etc",
        "Soil, which could be red or brown depending on the location in Africa",
        "African architectural design or styles if houses or structures are present",
        "Materials used in fencing or boundary construction typical in Africa, such as wooden fencing, bamboo, or even thorn bushes.",
        "Climate elements like intense sun or clear, blue skies.",
        "Fencing or boundaries",
        "Outdoor furniture (like tables, chairs, or swing sets)",
        "Landscaping elements (like trees, flowers, bushes, and gardens)",
        "A house or building usually in the background",
        "Other common backyard items like a grill, pool, or playset",
        "Depending on the region, you might see specific types of vegetation or animal wildlife.",
        "unique plants or trees native to East Asia",
        "architecture style often seen in East Asia, such as pagoda-style roofs, bamboo fences, stone lanterns, etc.",
        "Asian-inspired garden elements like koi ponds, bonsai trees, rock gardens, etc.",
        "characters or signage in East Asian languages",
        "common yard fixtures in East Asia like rice paper lanterns, bamboo wind chimes, etc.",
        "geographical features common in East Asia areas, such as mountains or bodies of water.",
        "garden benches or patio furniture",
        "typical European plants or trees",
        "fences or walls around the yard",
        "possibly garden decorations or sculptures",
        "an outdoor dining set",
        "small shed or greenhouse ",
        "paved paths or patios. ",
        "Presence of unique southeast asian plants such as bamboo or coconut trees",
        "Possible view of traditional Southeast Asian architecture",
        "Mosquito nets or other tropical weather adaptations",
        "Bright, warm and humid climate with abundant sunlight in the picture",
        "Presence of unique Southeast Asian animals/birds or insects. ",
        "Tiles flooring or garden paths are common",
        "Decorative features like koi ponds or Buddhist statues.",
        "Residential structures with flat roofs ",
        "Ornate architecture or tiles",
        "Palm trees or similar vegetation",
        "Courtyard-style gardens with water features",
        "Use of shade structures like pergolas ",
        "Fences or walls for privacy. ",
        "Outdoor seating or dining areas ",
        "Features that indicate hot climate e.g. outdoor fans, parasols, etc."
    ],
    "truck": [
        "Usually full of goods or containers",
        "Possibly dusty or muddy owing to local conditions ",
        "African scenery in the background",
        "Detailed exterior parts like lights, wheels, large grill",
        "Possible African company logos or regional language signs on the truck.",
        "Four or more wheels",
        "Heavy front bumper",
        "Large side view mirrors",
        "Cargo area or bed at the back",
        "Can be various colors, but commonly white, black, blue or red ",
        "Can have company logos or markings if it's a commercial truck",
        "Step up into the cab indicating higher ground clearance.",
        "Language or characters on the truck may be Korean, Chinese, Japanese, or other East Asian languages",
        "Driving on right side of the road in countries like Japan, Macau, or Hong Kong or on left in countries like China or South Korea",
        "Design or logo of Asian truck manufacturers such as Faw, Dongfeng, Hino, Isuzu, Hyundai or Tata Motors",
        " Features like shipping containers, if it's a delivery truck. ",
        "Regional license plate.",
        "The cab where the driver sits can be separate from the trailer (articulated lorry) or integrated with the cargo area (rigid truck)",
        "On the right side of the road, as traffic in most European countries drives on the right",
        "Logos or text on the vehicle could be in a European language",
        "May have a European license plate",
        "Might see local landmarks or architecture in the background ",
        "Side mirrors are usually quite large for visibility",
        "May have two sets of back wheels.",
        "Four or more large, bulky tires",
        "High front driving cab ",
        "Large cargo area with either open or closed top",
        "Shapes may vary from flatbeds, dumpers, tippers, or tankers",
        "Logos or text, potentially in languages from Southeast Asia such as Thai, Vietnamese, Indonesian etc.",
        "Seen transport goods, livestock or people",
        "In Southeast Asian settings like roads with typical regional architecture, landscapes or traffic signs.",
        "Large wheels",
        "Large front grille",
        "May have a company logo or advertisement printed on its side",
        "High cabin with side mirrors",
        "May have a cargo area at the back",
        "May be equipped with a horn or front guard",
        "Unique painting or decoration designs related to West Asian culture or motifs."
    ],
    "waste_container": [
        "often made from plastic or metal",
        "lid or opening at the top ",
        "common colors include green, blue, brown or gray",
        "may have signs or labels indicating the type of waste accepted ",
        "could be accompanied by a disposal or recycling logo",
        "depending on location, may see rubbish or litter disposed in or around it. ",
        "in rural Africa, waste containers may be simple baskets or bins made of local materials.",
        "Predominantly green, blue, black, or brown color",
        "Usually comes with a lid",
        "Symbols or text related to recycling, compost, or trash",
        "Handles or grips on the sides",
        "Wheeled base for easy movement",
        "Positioned on the street, sidewalk, or designated areas.",
        "typically large and round or rectangular",
        "made of plastic or metal",
        "can be of various colors such as green, blue, yellow, or red ",
        "often labeled with Chinese, Japanese, Korean, or other East Asian language characters",
        "often separated for different types of waste like plastic, glass, paper (multi-compartment or several bins together)",
        "sometimes has a lid",
        "often placed on the streets, in parks, or other public spaces.",
        "commonly colored green, blue, yellow, or grey",
        "often labeled with recycling symbols or waste type",
        "lid or covering on top",
        "two or four wheeled for mobility",
        "handled for operation ",
        "plastic or metal construction material.",
        "Can be made of plastic or metal",
        "Common colors are green, blue, or gray ",
        "Often has a lid",
        "Sometime features symbols or texts to denote its purpose",
        "Can be found outdoors near streets, parks, or commercial areas",
        "Might have unique features like peddles for hands-free operation",
        "Might have separate compartments for different types of waste (organic, recyclable) in some areas.",
        "Often round or rectangular in shape",
        "Large, typically taller than wide",
        "Usually green, blue, or grey",
        "May have lids",
        "May have labels or symbols indicating waste disposal",
        "Could be on the street, outside a building, or in a public area",
        "Sometimes on wheels for easy transport",
        "Possibly has a handle for lifting"
    ],
    "car": [
        "Metallic or painted body",
        "Windows and windshield",
        "Front and rear lights",
        "Side mirrors",
        "An engine section, usually in the front",
        "African landscape or vehicle license plate that corresponds to an African country",
        "Steering wheel inside the car ",
        "Car doors.",
        "License plate possibly on the front and rear",
        "Headlights and tail lights",
        "Side mirrors, usually two",
        "Steering wheel on the left side",
        "Windshield wipers",
        "Vehicle make or model insignia",
        "Possibly a rectangular frame around the license plate",
        "Variety of colors",
        "A wide range of shapes, styles and sizes depending on the type of car (SUV, sedan, truck etc.)",
        "Door handles.",
        "steering wheel on the right side",
        "Asian languages (such as Chinese, Japanese or Korean) on the number plate",
        "unique car brands like Toyota, Hyundai, Honda",
        "traffic signs in the background in Asian languages",
        "Asian architectural styles or landmarks in the background.",
        "Distinct car body shape: hatchback, sedan, SUV, etc.",
        "Manufacturer's logo or brand: European car brands like BMW, Mercedes, Audi, Peugeot, Volkswagen and more.",
        "License plate: European license plates have a unique format",
        "Steering wheel: In most European cars, it's located on the left side",
        "Mirrors and headlights: All cars have them, they can also be a useful feature. ",
        "Cars driving on the right side of the road, as is the norm in Europe.",
        "a body of varying colors",
        "windows and mirrors",
        "possibly right-hand drive, as most countries in Southeast Asia follow right-hand traffic rules",
        "possibly smaller size, as compact and economy cars are highly popular in Southeast Asia due to dense population and narrow roads",
        "license plates with non-English characters or unique numbering systems associated with Southeast Asian countries",
        "sometimes, additional accessories like scoops or spoilers as modifications are quite common in Southeast Asia.",
        "Typical car shape with wheels",
        "Steering wheel on the right side",
        "Vehicle brands typically found in West Asia like Toyota, Hyundai, Nissan",
        "License plate design and language consistent with West Asia",
        "Background and setting matching West Asian architecture and landscapes",
        "People in the car wearing clothing consistent with West Asian culture."
    ],
    "fence": [
        "Typically wooden or metal posts",
        "Could be wire or wooden slat construction",
        "It might be low to the ground or quite high, depending on its purpose",
        "Could be in close proximity to local flora, fauna, or traditional African buildings",
        "It may be in a rural or wilderness setting",
        "It could have a gate or entry point ",
        "May divide different areas of land.",
        "Typically made of wood, metal, or vinyl",
        "Common colors are white, brown, or green",
        "Connected by posts at regular intervals",
        "Can vary in height",
        "May have a gate or opening",
        "Forms a continuous barrier or boundary",
        "Patterns such as lattice, picket, or chain link",
        "Often made of wood or bamboo",
        "Connected with rope or wire",
        "Graced with traditional East Asian architectural elements",
        "Painted in neutral or earthy tones",
        "Presence of Chinese or Japanese style gate or doors within the fence",
        "Often surrounding a garden, temple or traditional home",
        "Sometimes comprised of stone or concrete with ornate designs.",
        "Vertical or horizontal panels or bars",
        "May have a gate",
        "Usually connected to posts",
        "Used to define or protect an area",
        "Various styles, from picket fences, slatted, wrought-iron, to hedges in countryside areas.",
        "Configuration of a boundary or barrier",
        "Made from materials like bamboo, wood, or metal",
        "Various styles such as picket, palisade, or lattice",
        "Frequently seen in rural and suburban areas ",
        "May be decorated with local Southeast Asian elements or motifs.",
        "Made from materials like wood, metal or stone",
        "Can be picket, wire mesh, or solid walls",
        "Sometimes, these might have traditional or Islamic design elements",
        "Can be in an arid or desert environment if in rural or non-urban parts of West Asia",
        "Surrounding landscape could include West Asian style architecture or flora."
    ],
    "road_sign": [
        "metallic or reflective material",
        "mounted on a pole or standalone structure",
        "often square, rectangular, circular or triangular in shape",
        "symbols, pictures, or words conveying traffic instructions",
        "may use bright colors, particularly yellow, white, and red",
        "wording could be in different languages depending on the country within Africa, for example French, English, Portuguese, Arabic or local languages. ",
        "the terrain or landscape in the background may suggest an African setting.",
        "bold lettering, often white on a green or blue background for informational signs, or red and white for prohibitory or stop signs",
        "use of particular symbols, such as a red octagon for a stop sign",
        "often reflective or high-visibility material",
        "mounted on a pole or post",
        "located adjacent to or above a roadway",
        "the use of arrows or other directive symbols.",
        "Pictorial symbols or text",
        "Generally rectangular, triangular, or circular shape",
        "Bright colors like red, yellow, blue or white",
        "Mounted on a pole or attached to a structure",
        "Text or symbols may include Asian scripts such as Chinese, Japanese, or Korean depending on the country",
        "Reflective material for visibility at night",
        "May include arrows or numbers indicating directions or speed limits.",
        "Bright colors such as red, blue or yellow",
        "Symbols or pictograms that represent road conditions or instructions",
        "Numbers indicating speed limits, distance, etc.",
        "May also contain words in the local language",
        "Generally located beside or above a road or highway",
        "Sometimes reflective for night visibility",
        "May be mounted on a pole or hung over the road.",
        "Symbols or text on the sign",
        "Might be in English or local languages like Thai, Vietnamese, or Indonesian",
        "Mounted on a pole",
        "Highly reflective surface for visibility at night",
        "Often in red, blue, yellow or white colors",
        "Might include specific road instruction or information.",
        "clipart-style graphics or symbols",
        "text scripts may be in Arabic or other local languages",
        "reflectorized material for visibility at night",
        "mounted on a pole or overhead gantry",
        "usually in bright and noticeable colors like red, yellow, green, blue, or black and white",
        "can be found at road sides or intersections",
        "might contain numbers to indicate speed limits or distance."
    ],
    "dog": [
        "furry coat, which can be various colors",
        "long snout",
        "majority have tails",
        "pointed ears (though some breeds have floppy ears)",
        "visible collar or markings from a leash, indicating domestication",
        "if in Africa, background indicators could include African wildlife, landscapes or identifiable landmarks.",
        "covered with fur, which can be of various colors and lengths",
        "a barking or panting mouth",
        "a wet, pointed nose",
        "rounded or pointed ears, standing up or hanging down",
        "tail that wags",
        "eyes that can vary in color from blue, to brown, to a mix of both",
        "often wear collars, tags, or harnesses in The Americas.",
        "fur-covered body",
        "varieties of colors including white, black, brown, grey, and mixed",
        "breeds commonly found in East Asia include Shiba Inu, Akita, Jindo, etc.",
        "tail shape and size can vary significantly depending on the breed",
        "typically have ears on the top of their heads",
        "common to see collars or harnesses on pet dogs",
        "size can vary greatly from small lap dogs to large shepherd breeds.",
        "variety of colors and sizes",
        "distinct breeds (such as Dachshunds, Boxers, and English Bulldogs which are common in Europe)",
        "typically has a tail (which can be long, short, or curly depending on the breed)",
        "fur covering the body",
        "prominent eyes and ears",
        "a snout.",
        "Has a tail",
        "Fur covering the body, with potential colors ranging from white, black, brown, gray, or a mix",
        "Ears could be droopy or erect depending on the breed",
        "Snout as its nose",
        "May have a collar or leash",
        "Generally domesticated and seen with humans or in human habitats",
        "Varieties in size from small to large depending upon the breed.",
        "four-legged mammal",
        "various colors such as black, white, brown, grey, or mixed",
        "hairy coat, which may be short or long, curly or straight",
        "erect, semi-erect or drooping ears",
        "a wagging tail, which varies in length ",
        "a wet nose",
        "distinctive breeds common in West Asia, such as Afghan Hound, Saluki, or Anatolian Shepherd."
    ],
    "wheelbarrow": [
        "Two legs at the back for stability",
        "Handles at the rear",
        "Generally made of metal or plastic",
        "Usually used to carry loads, so often full of materials like dirt or plants",
        "Commonly found in fields, gardens and construction sites ",
        "In Africa context, check for local designs and typical usage environment, like farms, markets, or rural settings.",
        "deep rectangular basin or 'tray'",
        "metal or plastic material ",
        "long handles at the back for pushing and steering",
        "often found in construction or gardening contexts ",
        "can be red, blue, green, or yellow",
        "can be loaded with various materials, such as dirt, bricks, or plants",
        "Handles at the rear",
        "Rectangular metal or plastic basin for carrying loads",
        "Stands on two legs when not in use. ",
        "Frequently seen in construction sites, farms, or gardens. ",
        "In East Asia, traditional wheelbarrows could be made of wood and have a more antiquated appearance.",
        "Sometimes painted bright colors.",
        "A large, usually metal, container for carrying materials",
        "Two handles at the back used for pushing",
        "Often seen in gardening or construction contexts",
        "May be seen with tools or materials such as soil, sand, or bricks inside",
        "Many are red or green, but can be other colors",
        "A long handle at one end",
        "A large, shallow rectangular or curved container at the other end for carrying loads",
        "Usually made of metal or plastic materials",
        "Commonly found in construction sites, gardens, farms, or markets. ",
        "In Southeast Asia context, it might be used in rural settings or street markets.",
        "Single wheel at the front",
        "Two handles at the rear",
        "A large rectangular or semi-circular bin or tub",
        "Typically made of steel or plastic and often painted in bright colors",
        "Sometimes found in construction sites or gardens",
        "May be loaded with materials like dirt, bricks, plants or tools."
    ],
    "religious_building": [
        "Features of distinct religions such as Crosses (for Christian churches), Islamic symbols like crescents (for mosques), etc.",
        "Round or rectangular structures with thatched or tin roofs (common for traditional African religions)",
        "Minarets for mosques",
        "Steeples or towers for churches",
        "Large gathering spaces (as religious buildings often serve as social community centres)",
        "Stained glass windows (for Christian churches)",
        "Symbols or carvings representing spiritual/religious entities.",
        "Steeple or bell tower",
        "Stained glass windows",
        "Large doors",
        "Altars or pulpits",
        "Benches or pews in rows",
        "Ornate architecture or statues",
        "Often much larger in size than surrounding buildings",
        "pagoda structures ",
        "elaborate rooftops with upturned eaves",
        "Buddhist symbols and statues",
        "often surrounded by beautifully designed gardens",
        "lanterns hanging outside",
        "vibrant colors such as red and gold",
        "typically found in serene environments.",
        "distinctive architectural styles such as Gothic, Romanesque, Renaissance, or Baroque",
        "presence of towers, domes, or spires",
        "stained glass windows",
        "religious symbols such as crosses, stars of David, or crescent moons",
        "often located in central or prominent locations within a city or town ",
        "often surrounded by a courtyard, cemetery, or garden.",
        "Large statues of religious figures, often Buddha, in Southeast Asia.",
        "Gold, red, or white colors are often dominant.",
        "Elements of nature, like gardens, lotus ponds, and trees incorporated into the design.",
        "Ornate artistic details, like carvings and murals.",
        "Large, complex layouts with multiple buildings and courtyards, particularly in Buddhist monasteries.",
        "Often located in picturesque locations, such as on top of hills, by rivers, etc. ",
        "Distinct architecture styles such as Thai, Cambodian (Angkor), Burmese, and Balinese styles in Southeast Asia, which are different from Western religious building styles.",
        "Dome-shaped structures",
        "Minarets or towers",
        "Arched doors and windows",
        "Geometric or floral patterns and calligraphy on walls",
        "Often built with stone or brick ",
        "Large courtyard",
        "Use of arches and vaults in construction ",
        "Presence of prayer halls."
    ],
    "stall": [
        "Often with corrugated metal rooftops or sides",
        "Selling local produce or goods",
        "African-style handcrafted items",
        "Sellers who are typically African people",
        "Signage written in local or multiple languages",
        "The presence of African landscapes or urban backgrounds",
        "Animals such as goats or chickens roaming around could also hint the location.",
        "Tent or booth structure",
        "Can be of any color, but often seen in bright colors",
        "Display of various goods, which can range from food, clothes, accessories, to souvenirs ",
        "Price tags or labels in English or Spanish, or other languages spoken in the Americas ",
        "Canopy or umbrella for shade",
        "Stall keepers often dressed casually",
        "Cash register or money box",
        "Plastic, paper, or eco-friendly bags for purchased goods",
        "Located in a market, fair, or street.",
        "typically small and individual outdoor vendor spaces",
        "variety of goods available, potentially including food, clothes, or souvenirs",
        "signs written in Asian languages such as Chinese, Japanese, or Korean",
        "umbrellas or other types of cover overhead",
        "street food equipment like grills, steamers or pot stands",
        "decoration and designs influenced by East Asian culture.",
        "Tented or covered structure",
        "Counter or table for displaying goods",
        "Signs written in European languages",
        "European currency",
        "Regional items or food for sale",
        "Local surroundings or architecture ",
        "People interacting with the stall",
        "Depending on the location, characteristic decorations or color schemes.",
        "Often covered with a tarp or other material for shade",
        "Variety of goods for sale, such as food, clothes, accessories, souvenirs",
        "Street-side location ",
        "Vendor usually present ",
        "Signs displaying prices, often in local currency",
        "Local people as customers",
        "Surrounding environment may depict Southeast Asian architecture or features",
        "Foods or items indigenous to Southeast Asia may be noticeable.",
        "Presence of goods for sale such as foods, spices, textiles, jewelry, etc.",
        "Vendor or sales person, possibly dressed in traditional West Asian attire. ",
        "Signage might be in Persian, Arabic, or other West Asian languages or scripts.",
        "Located possibly in a bustling market or bazaar.",
        "Traditional Middle Eastern architectural elements in the background such as domes, arches or mosaics.",
        "Tents or awnings providing shade. ",
        "Traditional rugs or carpets. ",
        "Outdoor setting."
    ],
    "boat": [
        "Flat bottom or V-shaped hull ",
        "Cabin or seating area",
        "Engines or sails ",
        "African landscape in the backdrop such as a river, lake or sea.",
        "Human figures wearing African attire",
        "Presence of African wildlife in the backdrop could also be a clue ",
        "The design and style of the boat can also give a clue; for example, canoes and pirogues are common in Africa.",
        "a deck, hull, and cabins for larger boats",
        "sails and mast for a sailboat",
        "fishing equipment for fishing boats",
        "a motor at the back for motorboats",
        "a prow at the front",
        "rudders and propellers ",
        "on water, typically sea or lakes",
        "flags or identifiers that can signify the boat is from The Americas.",
        "Often made of wood",
        "Can be small fishing boats to large junk ships",
        "Distinctive sail designs, if it is a sailboat",
        "Can be painted with bright colors or have dragon designs, particularly for dragon boats",
        "Presence of lanterns or other lighting fixtures for night fishing",
        "Presence of fishing nets or equipment, if it's a fishing boat.",
        "sails or engines for propulsion",
        "masts for sailboats",
        "some may have flags or specific design elements that can indicate the European origin",
        "the boat may also be in a recognizable European location (e.g., canals of Venice, Mediterranean sea) ",
        "steer wheel or helm",
        "cabins or an open deck, depending on the type of boat.",
        "Colorful decorations or paintings",
        "Canopy or awning over passenger seating area",
        "Baskets or nets indicating fishing equipment",
        "Typically seen on the water, often near beaches or islands",
        "Constructed from wood or bamboo materials in some cases",
        "Motor at the back of the boat attached to a long metal shaft with a propeller at the end.",
        "Mostly made of wood, metal, or fiberglass",
        "Generally have one or more masts with sails",
        "Typically equipped with an outboard motor or a propeller",
        "May have a cabin or open deck space",
        "Can often be found in bodies of water (such as the Arabian Sea, Persian Gulf, Caspian Sea, etc.)",
        "May be seen near a dock or port",
        "Can have various colors but largely dominated by hues of blue, white or brown."
    ],
    "monument": [
        "Symbols or representations of historical or cultural significance, possibly related to the African history or culture",
        "May be placed in an open public place ",
        "Surrounded by tourists or pedestrians",
        "Often well-lit or spotlighted at night ",
        "May be in proximity to signs providing information about the monument.",
        "Large or impressive size",
        "Recognizable shape",
        "Historic inscriptions or plaques",
        "Associated with historic events or figures",
        "Tourists taking pictures around or in front of the monument",
        "Often located in public, easily accessible areas",
        "Flags or symbols of the country where the monument is located could be present.",
        "Use of traditional Eastern symbols and motifs",
        "Inscriptions in East Asian languages",
        "Traditional roofing styles, such as the curved roofs seen in Chinese and Korean architecture",
        "Pagodas, torii gates, or Buddhist statues",
        "Landscape with typical East Asian flora, like bamboo, cherry blossoms or bonsai trees ",
        "People in the photo may be dressed in traditional East Asian clothing.",
        "Architectural characteristics common in European culture ",
        "Classical, Gothic, Renaissance or Baroque style ",
        "Signage in European languages ",
        "Located in busy city centers or important historical sites ",
        "Surrounded by European styled buildings",
        "Often large in scale and unique in design ",
        "Frequently visited by tourists.",
        "Architectural structures such as stupas, temples, or statues",
        "Scripts and inscriptions, often in local languages",
        "Ornate carvings and detailed craftsmanship",
        "Use of materials such as stone, brick, or gold",
        "Location can also be a clue, as many Southeast Asian monuments are set in historical or significant natural environments. ",
        "Elements representing cultural uniqueness of specific country in Southeast Asia (For example, Thangka in Thailand, Pagoda in Myanmar, Angkor wat in Cambodia and Borobudur in Indonesia.)",
        "domes and minarets",
        "intricate patterns or calligraphy",
        "often built with materials such as stone or brick",
        "arched doorways or windows",
        "located in open squares or elevated places",
        "often has historical or religious significance."
    ],
    "flag": [
        "Possibly contains colors representative of African flags such as red, green, yellow, and black",
        "Symbols or emblems representative of an African country",
        "Mounted on a pole",
        "Fluttering in the wind",
        "Stars or other symbols on the flag",
        "Colors representative of certain countries (like red, white and blue for the United States)",
        "Flagpole ",
        "Flags often blowing in the wind ",
        "Shape - typically rectangular",
        "Specific designs unique to particular countries",
        "flagpole",
        "unique designs or symbols that represent particular East Asian countries",
        "primary colors often include red, white, blue, yellow or black",
        "may display stars, circles, stripes, or symbolic images (like a dragon or crane).",
        "Fabric material",
        "Attached to a pole",
        "Unique design or pattern ",
        "Colors that match a specific European country’s flag ",
        "Emblem or coat of arms, particularly for national flags. ",
        "Often displayed on public buildings or landmarks of the specific country",
        "Can be seen waving if the picture is taken on a windy day",
        "A pole or mast",
        "Bold and vibrant colors like red, white, blue, yellow or green",
        "Specific symbols or emblems, such as stars, stripes or crescents",
        "Often have geometric patterns or designs",
        "May have unique cultural or historical symbols related to the specific Southeast Asian country.",
        "Varied colors depending on the country, such as green, red, white, black, and blue",
        "Symbolic designs or emblems, which may include stars, crescents, or scripts ",
        "Rectangular in shape",
        "Mostly, vertical or horizontal strips",
        "Sometimes, attached to a flagpole."
    ],
    "bus": [
        "Multiple windows in rows",
        "Doors for passenger entrance and exit",
        "Usually brightly colored or adorned with local designs",
        "Markings or text in local languages ",
        "Crowds of people often found around it",
        "Typically larger than surrounding cars or motorcycles",
        "Traveling on predominantly dry, often unpaved, roads",
        "Rural or urban African landscapes in the background",
        "Multiple windows in rows ",
        "Big tires",
        "A front and back door",
        "Seats inside visible through windows",
        "Destination sign/number above the front windshield",
        "Bi-fold doors towards the front",
        "Large side mirrors",
        "Often brightly colored or with specific company branding",
        "May have an extendable wheelchair ramp on the side near the front.",
        "Public transport signage or symbols",
        "Large windows at the sides",
        "One, two or three doors on the side depending on the size",
        "Seats visible through the windows",
        "Bus number and destination display at the front",
        "Asian language (like Chinese, Japanese, Korean etc) writing on the bus.",
        "Multiple windows in a row",
        "Two or more large wheels on each side",
        "Doors on either the front, middle, or back",
        "Distinctive paint job or decals indicating its the city or region it services",
        "An electronic sign at the front displaying the route number or destination",
        "Side mirrors on the front",
        "Presence of a bus stop or station in the background.",
        "multiple windows in a row ",
        "side doors for entry and exit",
        "can be multiple colors but often brightly colored or has graphics",
        "conductors may be seen hanging off side doors",
        "generally more overcrowded than western buses",
        "may have signage in local languages, English or numbers",
        "typically, they have larger and wider front and rear bumpers for passenger safety.",
        "Multiple windows in rows",
        "Distinct front with large windscreen ",
        "Large side doors for passengers",
        "Logo or branding of local transport services ",
        "Number plate design specific to West Asia",
        "Landscape or architecture typical of West Asia in the background",
        "Crowded with passengers or stationed at a bus stop",
        "People entering/exiting the bus",
        "Written text – destination, route details, in a language commonly used in West Asia."
    ],
    "storefront": [
        "African language texts or symbols",
        "Traditional African designs and colours on the storefront",
        "Local African goods or products on display ",
        "African people in and around the shop",
        "Architectural styles common in Africa like thatched roofs, mud-brick walls, brightly painted walls",
        "African landscape or street scenes in the background.",
        "a visible sign with the store's name",
        "display of merchandise or advertisements in the windows",
        "doors for customer entrance",
        "often located on a street with other stores",
        "may have an awning or a canopy",
        "may feature lights around the display window or store sign",
        "outdoor signage with business hours",
        "Architecture consistent with East Asian styles",
        "Store or product names, popular in East Asia",
        "Display of goods common in East Asian countries",
        "Regional brand logos",
        "Distinctive cultural symbols and colors",
        "Crowds and merchandise that reflect the local population",
        "Street layout and surroundings indicating East Asian cities.",
        "Signs or writings in European languages",
        "Display windows showing merchandise",
        "Outside seating if it’s a café or restaurant",
        "European brand logos",
        "Cobblestone streets or typical European street views",
        "Storefront awnings or canopies",
        "Outdoor flower displays or window boxes",
        "Store name and business hours posted near the entrance",
        "People around wearing typical European clothing styles",
        "Multiple signage, often with Asian scripts",
        "The storefront is generally narrow and multi-storied",
        "Merchandise or food placed in front of the store",
        "Bright, colorful advertisements and lights",
        "Traditional Asian architectural design for some stores",
        "Street vendors and packed streets often in the vicinity",
        "Tropical vegetation in case outdoor areas are also visible.",
        "Arabic or Persian signs or scripts",
        "Built with traditional architectural designs of West Asia like arches and mosaics",
        "Products like spices, textiles, and traditional arts and crafts displayed in the store's entryway",
        "Middle Eastern decor such as lanterns and rugs",
        "May show people wearing traditional West Asian clothing",
        "Merchandise arranged on shelves and counters observable from outside."
    ],
    "bicycle": [
        "bike frame",
        "handlebars",
        "bike seat",
        "often seen on rural roads, dirt roads, or in village settings in Africa",
        "local people riding them",
        "goods or cargo loaded on them, often seen in African settings",
        "may be old and well-used indicating heavy usage typical in various parts of Africa.",
        "a frame connecting the wheels",
        "a saddle seat",
        "handlebars for steering",
        "gear system (often in The Americas)",
        "a chain connecting the gears and pedals",
        "reflectors or lights for visibility",
        "water bottle holder (common in The Americas)",
        "helmet (common in The Americas)",
        "A frame connecting the wheels",
        "A saddle for the rider",
        "One or two handlebars for steering",
        "Pedals for propulsion",
        "In many East Asian countries, bicycles may also have a basket at the front or back",
        "Bicycles in East Asia are also often equipped with lights and fenders",
        "Additionally, because cycling is a popular means of transportation in East Asia, the bicycle might be in urban scenery, near a bike parking area, or in a bike lane.",
        "Frame connecting the wheels",
        "Handlebars for steering",
        "A saddle seat",
        "Pedals for propulsion",
        "Sometimes a basket or rear rack for storage",
        "Usually made of metal, primarily aluminum and steel",
        "Depending on the country, bicycles might have bells, lights, and reflectors as they are mandatory in some European countries.",
        "handlebars",
        "a saddle (seat)",
        "one or more gear mechanisms",
        "bicycle baskets or carriers, often used in Southeast Asia ",
        "bright colors or decorations, commonly seen in Southeast Asia",
        "people riding without helmets which is common in some parts of Southeast Asia",
        "narrow tires",
        "buildings, greenery or traffic typical of Southeast Asia in the background.",
        "handlebars for steering",
        "a seat for the rider",
        "a frame connecting the wheels",
        "pedals for propelling the bicycle",
        "usually, thinner tires compared to Western bicycles",
        "sometimes, baskets or racks for carrying goods",
        "the background or landscape might show features typical of West Asia such as architecture, vegetation, landmarks or people's clothing."
    ]
}