{
    "bag": [
        "Typically, the designs may be influenced by East Asian culture.",
        "It can have various shapes and sizes, from small purses to large backpacks.",
        "The presence of straps or handles.",
        "Incorporation of local patterns, symbols or scripts.",
        "Could be carried by a person or placed on a surface.",
        "Zippers, buckles, or closures may be visible."
    ],
    "hand_soap": [
        "dispenser pump on top",
        "liquid or gel-like substance",
        "labels often containing characters from East Asian languages (such as Chinese, Korean, or Japanese)",
        "sometimes clear or semi-transparent container to show the soap inside",
        "available in various colors depending on the type of soap. ",
        "often seen in bathroom setting or near sinks."
    ],
    "dustbin": [
        "made of plastic, metal, or other materials",
        "can have lids",
        "commonly comes in colors such as green, blue, grey, brown, or black",
        "regularly labeled with recycling or garbage signage",
        "located at street corners, parks, and in front of buildings",
        "can have a pedal for hands-free opening",
        "unique designs or shapes depending on the country."
    ],
    "toothbrush": [
        "bristles at one end",
        "can be various colors",
        "some models might have a tongue cleaner on the back of the head",
        "battery-operated versions might have a thicker handle",
        "specific brand features relating to East Asian brands."
    ],
    "toothpaste_toothpowder": [
        "Typically contained in a small bottle or jar",
        "Powdery texture",
        "Labels could be in East Asian languages such as Chinese, Japanese, or Korean",
        "Common brands may include Lion, Darlie or Yunnan Baiyao",
        "Usually comes with a small spoon or spatula for dispensing",
        "May display symbols of dental health or images of teeth on packaging ",
        "Packaging colors typically white, blue, green, or red."
    ],
    "hairbrush_comb": [
        "handle for gripping",
        "row of teeth or bristles",
        "can be made from plastic, wood, or metal",
        "comes in various sizes and shapes ",
        "certain styles can reflect East Asian aesthetics, such as the intricate wooden combs seen in China"
    ],
    "chair": [
        "a seat",
        "a backrest",
        "made of materials such as wood, bamboo, or metal",
        "Asian-style design features like simple lines, minimalistic design, or lacquered finish",
        "could be low to the ground, in traditional styles",
        "circular seat in some traditional designs",
        "decorative elements reflecting East Asian culture."
    ],
    "hat": [
        "made from bamboo, straw, or fabric",
        "could be in a conical shape or flat-topped ",
        "sometimes has chin straps",
        "Patterns may vary, including solid colors to intricate woven designs or embroidered patterns",
        "In some cases, it can have symbols that symbolize East Asian culture."
    ],
    "light_fixture": [
        "Lantern-shaped designs are common",
        "Red, gold and black colors frequently used",
        "Traditional fixtures may have intricate patterns or artistic designs",
        "Modern fixtures may have sleek, streamlined shapes",
        "May have Chinese characters or symbols",
        "Paper, silk, and wood, as well as metal and glass, are common materials",
        "Electric bulb or candles can be seen for illumination."
    ],
    "light_switch": [
        "Often square or rectangular in shape",
        "Usually white or light colored",
        "Oftentimes located on the wall",
        "In some countries like Japan, they may be larger with multiple switches",
        "Some might have labels or icons showing the function",
        "Usually installed at a standard height on the wall, close to the door frame",
        "May have one or more buttons or switches",
        "The switch flips up and down or side-to-side to turn on/off the light."
    ],
    "plate_of_food": [
        "Chopsticks or spoons as utensils",
        "Rice or noodles as a staple dish",
        "Wide variety of vegetables, meats, and seafood",
        "Soup often included as part of a meal",
        "Unique dishes like dumplings, sushi, kimchi, etc.",
        "Use of spices and sauces",
        "Steamed or stir-fried dishes",
        "Tea or other traditional drinks often accompanying the meal."
    ],
    "spices": [
        "vibrant colors ranging from yellow (turmeric) to red (chilli powder) to brown (cumin)",
        "seeds, roots, bark, fruits, etc, in either whole or ground form",
        "labels in East Asian languages",
        "traditional East Asian bowls, spoons and other utensils",
        "distinct shapes of specific spices, like star anise, clove, cardamom."
    ],
    "stove": [
        "Made of steel or ceramic material",
        "Usually white, silver, or black in color",
        "Controlled dials and buttons",
        "Burners or induction zones on top",
        "Sometimes have a range hood on top ",
        "Some may have an oven at the bottom",
        "Typically located in the kitchen."
    ],
    "cooking_pot": [
        "Usually made of metal (stainless steel, cast iron, or aluminum) or ceramic",
        "Often has two small handles on the sides",
        "A lid that fits on top",
        "Sometimes with a spout for pouring",
        "May have a polished or matte finish",
        "Could be over a stove or a fire",
        "Might have food or liquid inside",
        "In the context of East Asia, might be a wok or a clay pot."
    ],
    "cleaning_equipment": [
        "Natural bristle wisk broom",
        "Plastic bucket for water",
        "Square-shaped scoops or dustpans",
        "Cleaning slippers ",
        "Cleaning rag",
        "Squeegee for cleaning windows",
        "Mop with replaceable cloth pads ",
        "Dust masks for cleaning dusty areas."
    ],
    "lighter": [
        "Metal or plastic body",
        "A wheel or button for ignition",
        "Flame when ignited",
        "Often carry imagery, logos, or text on the body",
        "Fuel refill point at the bottom",
        "Portability",
        "Could possibly see it in someone's hand",
        "Brand logos such as Zippo or BIC that are common in East Asia"
    ],
    "medicine": [
        "Typically packaged in small bottles, boxes or blister packs",
        "Labels may be written in Chinese, Japanese, or Korean characters ",
        "Symbols or logos specific to East Asian pharmaceutical companies",
        "Images or illustrations of herbs and plants, as traditional medicine is popular in East Asia",
        "May come in various forms like pills, tablets, capsules, liquids, powders, or even in raw form as herbs."
    ],
    "candle": [
        "Wax or gel cylinder or block shape ",
        "Wick in the center of the candle",
        "Warm, soft glowing light when lit",
        "May be placed in a glass or metal holder",
        "Sometimes decorated with symbols or scripts ",
        "Often associated with spiritual or religious practices and ceremonies such as Buddha's Birthday",
        "May come in a variety of sizes and colors."
    ],
    "toy": [
        "Often brightly colored or patterned",
        "May have Asian characters or symbols",
        "Often depict characters from popular Asian animations or comics",
        "May be made from materials such as plastic, cloth, or wood",
        "Could be traditional toys like dolls, paper toys, wooden toys",
        "Alternatively, could be modern toys like electronic games, building sets",
        "Size can vary but typically small enough for a child to play with."
    ],
    "jug": [
        "Commonly white or light-colored with painted designs",
        "May have a spout ",
        "An attached handle for holding",
        "Can be round or more cylindrical in shape ",
        "Often has a lid",
        "May contain traditional Asian motifs and patterns."
    ],
    "streetlight_lantern": [
        "lantern-style light fixtures on top, typically with a round or cylindrical shape",
        "the lights can be of various colors but usually white, yellow, or orange tones",
        "ornate designs, often alloy or metal, reflecting cultural aesthetics ",
        "sometimes embellished with traditional symbols or patterns",
        "usually found beside the roads or in a public area",
        "may have grills or patterned cut-outs to cover the light bulb."
    ],
    "front_door": [
        "rectangular shape",
        "a centrally positioned door knob or handle",
        "often decorated or painted with bright colors",
        "can feature Asian architecture styles like scrollwork, lattice patterns, or circular \"moon gates\"",
        "could have traditional Asian symbols or characters on it",
        "equipped with a door step, according to the traditional Chinese culture. ",
        "may include a unique combination of wood and metalwork. ",
        "can sometimes feature intricate carvings."
    ],
    "tree": [
        "Broad leaves or needle-like leaves",
        "Specific characteristics of common East Asian trees (such as cherry blossoms, bamboo stalks, or gingko leaves)",
        "Presence of fruits or nuts",
        "Shape and size of the tree",
        "Root structure",
        "Location, such as within a forest or in a cityscape."
    ],
    "house": [
        "Tiled roofs, often curved at the edges",
        "Use of natural materials like wood and stone",
        "Tranquil gardens featuring ponds and bridges",
        "Multilayered roofs in traditional houses",
        "Sliding doors or screens",
        "Courtyards in Chinese houses",
        "Korean Hanoks made up of small, square rooms",
        "Japanese houses often have Tatami floors",
        "Decorative carvings or bright colors in some regions."
    ],
    "backyard": [
        "unique plants or trees native to East Asia",
        "architecture style often seen in East Asia, such as pagoda-style roofs, bamboo fences, stone lanterns, etc.",
        "Asian-inspired garden elements like koi ponds, bonsai trees, rock gardens, etc.",
        "characters or signage in East Asian languages",
        "common yard fixtures in East Asia like rice paper lanterns, bamboo wind chimes, etc.",
        "geographical features common in East Asia areas, such as mountains or bodies of water."
    ],
    "truck": [
        "Language or characters on the truck may be Korean, Chinese, Japanese, or other East Asian languages",
        "Driving on right side of the road in countries like Japan, Macau, or Hong Kong or on left in countries like China or South Korea",
        "Design or logo of Asian truck manufacturers such as Faw, Dongfeng, Hino, Isuzu, Hyundai or Tata Motors",
        " Features like shipping containers, if it's a delivery truck. ",
        "Regional license plate."
    ],
    "waste_container": [
        "typically large and round or rectangular",
        "made of plastic or metal",
        "can be of various colors such as green, blue, yellow, or red ",
        "often labeled with Chinese, Japanese, Korean, or other East Asian language characters",
        "often separated for different types of waste like plastic, glass, paper (multi-compartment or several bins together)",
        "sometimes has a lid",
        "often placed on the streets, in parks, or other public spaces."
    ],
    "car": [
        "steering wheel on the right side",
        "Asian languages (such as Chinese, Japanese or Korean) on the number plate",
        "unique car brands like Toyota, Hyundai, Honda",
        "traffic signs in the background in Asian languages",
        "Asian architectural styles or landmarks in the background."
    ],
    "fence": [
        "Often made of wood or bamboo",
        "Connected with rope or wire",
        "Graced with traditional East Asian architectural elements",
        "Painted in neutral or earthy tones",
        "Presence of Chinese or Japanese style gate or doors within the fence",
        "Often surrounding a garden, temple or traditional home",
        "Sometimes comprised of stone or concrete with ornate designs."
    ],
    "road_sign": [
        "Pictorial symbols or text",
        "Generally rectangular, triangular, or circular shape",
        "Bright colors like red, yellow, blue or white",
        "Mounted on a pole or attached to a structure",
        "Text or symbols may include Asian scripts such as Chinese, Japanese, or Korean depending on the country",
        "Reflective material for visibility at night",
        "May include arrows or numbers indicating directions or speed limits."
    ],
    "dog": [
        "fur-covered body",
        "varieties of colors including white, black, brown, grey, and mixed",
        "breeds commonly found in East Asia include Shiba Inu, Akita, Jindo, etc.",
        "tail shape and size can vary significantly depending on the breed",
        "typically have ears on the top of their heads",
        "common to see collars or harnesses on pet dogs",
        "size can vary greatly from small lap dogs to large shepherd breeds."
    ],
    "wheelbarrow": [
        "Handles at the rear",
        "Rectangular metal or plastic basin for carrying loads",
        "Stands on two legs when not in use. ",
        "Frequently seen in construction sites, farms, or gardens. ",
        "In East Asia, traditional wheelbarrows could be made of wood and have a more antiquated appearance.",
        "Sometimes painted bright colors."
    ],
    "religious_building": [
        "pagoda structures ",
        "elaborate rooftops with upturned eaves",
        "Buddhist symbols and statues",
        "often surrounded by beautifully designed gardens",
        "lanterns hanging outside",
        "vibrant colors such as red and gold",
        "typically found in serene environments."
    ],
    "stall": [
        "typically small and individual outdoor vendor spaces",
        "variety of goods available, potentially including food, clothes, or souvenirs",
        "signs written in Asian languages such as Chinese, Japanese, or Korean",
        "umbrellas or other types of cover overhead",
        "street food equipment like grills, steamers or pot stands",
        "decoration and designs influenced by East Asian culture."
    ],
    "boat": [
        "Often made of wood",
        "Can be small fishing boats to large junk ships",
        "Distinctive sail designs, if it is a sailboat",
        "Can be painted with bright colors or have dragon designs, particularly for dragon boats",
        "Presence of lanterns or other lighting fixtures for night fishing",
        "Presence of fishing nets or equipment, if it's a fishing boat."
    ],
    "monument": [
        "Use of traditional Eastern symbols and motifs",
        "Inscriptions in East Asian languages",
        "Traditional roofing styles, such as the curved roofs seen in Chinese and Korean architecture",
        "Pagodas, torii gates, or Buddhist statues",
        "Landscape with typical East Asian flora, like bamboo, cherry blossoms or bonsai trees ",
        "People in the photo may be dressed in traditional East Asian clothing."
    ],
    "flag": [
        "flagpole",
        "unique designs or symbols that represent particular East Asian countries",
        "primary colors often include red, white, blue, yellow or black",
        "may display stars, circles, stripes, or symbolic images (like a dragon or crane)."
    ],
    "bus": [
        "Public transport signage or symbols",
        "Large windows at the sides",
        "One, two or three doors on the side depending on the size",
        "Seats visible through the windows",
        "Bus number and destination display at the front",
        "Asian language (like Chinese, Japanese, Korean etc) writing on the bus."
    ],
    "storefront": [
        "Architecture consistent with East Asian styles",
        "Store or product names, popular in East Asia",
        "Display of goods common in East Asian countries",
        "Regional brand logos",
        "Distinctive cultural symbols and colors",
        "Crowds and merchandise that reflect the local population",
        "Street layout and surroundings indicating East Asian cities."
    ],
    "bicycle": [
        "A frame connecting the wheels",
        "A saddle for the rider",
        "One or two handlebars for steering",
        "Pedals for propulsion",
        "In many East Asian countries, bicycles may also have a basket at the front or back",
        "Bicycles in East Asia are also often equipped with lights and fenders",
        "Additionally, because cycling is a popular means of transportation in East Asia, the bicycle might be in urban scenery, near a bike parking area, or in a bike lane."
    ]
}